{
    ".authorMsg": "- Traducción al Español realizado por Ruben Martins :)",
    "DualShock Calibration GUI": "GUI de Calibración DualShock",
    "Unsupported browser. Please use a web browser with WebHID support (e.g. Chrome).": "Browser no supportado. Por favor utiliza un explorador con soporte WebHID (ej. Chrome).",
    "Connect a DualShock 4 or a DualSense controller to your computer and press Connect.": "Conecta un DualShock 4 o un controlador DualSense a tu ordenador y pulsa Conectar",
    "Connect": "Conectar",
    "Connected to:": "Conectar a:",
    "Disconnect": "Desconectar",
    "Firmware Info": "Información del Firmware",
    "Calibrate stick center": "Calibrar centro del Analog",
    "Calibrate stick range (permanent)": "Calibrar el rango del Analog (permanente)",
    "Calibrate stick range (temporary)": "Calibrar el rango del Analog (temporal)",
    "Reset controller": "Resetear controller",
    "Sections below are not useful, just some debug infos or manual commands": "Las secciones de abajo no son utilies, solo informacion de depuración o mandos manuales",
    "NVS Status": "Estado NVS",
    "Unknown": "Desconocido",
    "BD Addr": "Dirección BD",
    "Debug buttons": "Botones de depuración",
    "Query NVS status": "OttieConsulta de estado NVS",
    "NVS unlock": "Desbloqueo NVS",
    "NVS lock": "Bloqueo NVS",
    "Get BDAddr": "Obtener BDAddr",
    "Fast calibrate stick center (OLD)": "Calibración RÁPIDA centro Analog (Antiguo)",
    "Stick center calibration": "Calibración del centro del Analog",
    "Welcome": "Bienvenido",
    "Step 1": "Paso 1",
    "Step 2": "Paso 2",
    "Step 3": "Paso 3",
    "Step 4": "Paso 4",
    "Completed": "Completado",
    "Welcome to the stick center-calibration wizard!": "Bienvenido al asistente de calibración del centro del Analog!",
    "This tool will guide you in re-centering the analog sticks of your controller. It consists in four steps: you will be asked to move both sticks in a direction and release them.": "Esta herramienta le guiará a volver a centrar los Sticks analógicos. Se realiza en cuatro pasos: Se le pide que mueva los analogicos en una dirección y que los suelte.",
    "Please be aware that, <i>once the calibration is running, it cannot be canceled</i>. Do not close this page or disconnect your controller until is completed.": "Atención: <i>la calibración NO se puede interrumpir</i>. No cierre esta página, ni desconecte el mando hasta que este COMPLETO.",
    "Calibration storage": "Calibracón guardada!",
    "By default the calibration is only saved in a volatile storage, so that if you (or this tool) mess something up, a reset of the controller is enough to make it work again.": "Por defecto la calibración se guarda en la memória volatil, si tu (o esta herramienta) genera algun problema, un reset del mando es suficiente para volver a funcionar otra vez.",
    "If you wish to store the calibration permanently in the controller, tick the checkbox below:": "Si prefieres, se puede guardar la calibración de forma permanente, para ello selecciona la casilla de abajo:",
    "Write changes permanently in the controller": "Guardar configuración de forma permanente en el mando",
    "<small>Warning: <font color=\"red\">Do not store the calibration permanently if the controller battery is low or disconnected. It will damage your controller.</font></small>": "<small>Aviso: <font color='red'>No guardar la calibración de forma permanente si el mando esta con la bateria baja, o se desconecta. Eso provoca daños en el mando.</font></small>",
    "Press <b>Start</b> to begin calibration.": "Pulsa <b>Empezar</b> para iniciar calibración",
    "Please move both sticks to the <b>top-left corner</b> and release them.": "Mueve la palanca <b>arriba-izquierda</b> y suelta.",
    "When the sticks are back in the center, press <b>Continue</b>.": "Cuando vuelva al centro , pulsa <b>Continuar</b>",
    "Please move both sticks to the <b>top-right corner</b> and release them.": "Mueve la palanca <b>arriba-derecha</b> y suelta.",
    "Please move both sticks to the <b>bottom-left corner</b> and release them.": "Mueve la palanca <b>abajo-izquierda</b> y suelta.",
    "Please move both sticks to the <b>bottom-right corner</b> and release them.": "Mueve la palanca <b>abajo-derecha</b> y suelta.",
    "Calibration completed successfully!": "Calibración realizada con exito!",
    "Next": "Siguiente",
    "Recentering the controller sticks. ": "Centrando las Analogicas del mando ",
    "Please do not close this window and do not disconnect your controller. ": "Por favor, no cierre esta ventana y no desconectar el mando ",
    "Range calibration": "Rango de calibracón",
    "<b>The controller is now sampling data!</b>": "<b>El mando es informacion de muestra!</b>",
    "Rotate the sticks slowly to cover the whole range. Press \"Done\" when completed.": "Girar los analógicos despacio para cubrir todo rango. Pulsa \"Listo\" cuando terminado.",
    "Done": "Listo",
    "Hi, thank you for using this software.": "Hola, gracias por utilizar este programa.",
    "If you're finding it helpful and you want to support my efforts, feel free to": "Si te ha parecido util y te gustaria apoyar mi esfuerzo, no te cortes",
    "buy me a coffee": "y comprame un café",
    "! :)": "! :)",
    "Do you have any suggestion or issue? Drop me a message via email or discord.": "Tienes alguna sugerencia o problema? Hazme lo saber por email o discord",
    "Cheers!": "Viva!",
    "Support this project": "Apoya este proyecto",

    "unknown": "desconocido",
    "original": "original", 
    "clone": "clone", 
    "locked": "bloqueado",
    "unlocked": "desbloqueado",
    "error": "error",
    "Build Date:": "Data Build:",
    "HW Version:": "Version HW:",
    "SW Version:": "Version SW:",
    "Device Type:": "Tipo Device:",
    "Firmware Type:": "Tipo Firmware:",
    "SW Series:": "Serie SW:",
    "HW Info:": "Info HW:",
    "SW Version:": "Version SW:",
    "UPD Version:": "Version UPD:",
    "FW Version1:": "Version FW1:",
    "FW Version2:": "Version FW2:",
    "FW Version3:": "Version FW3:",

    "Range calibration completed": "Rango Calibración Completo",
    "Range calibration failed: ": "Rango Calibración FALLIDO: ",
    "Cannot unlock NVS": "Impossible desbloquear NVS", 
    "Cannot relock NVS": "Impossible bloquear NVS", 
    "Error 1": "Error 1",
    "Error 2": "Error 2",
    "Error 3": "Error 3",
    "Stick calibration failed: ": "Callibración Analogica FALLIDA: ",
    "Stick calibration completed": "Calibrazión Analogica Completa",
    "NVS Lock failed: ": "Bloqueo NVS Fallido: ",
    "NVS Unlock failed: ": "Desbloqueo NVS Fallido: ",
    "Please connect only one controller at time.": "Por favor, conecta un mando a la vez.",
    "Sony DualShock 4 V1": "Sony DualShock 4 V1",
    "Sony DualShock 4 V2": "Sony DualShock 4 V2",
    "Sony DualSense": "Sony DualSense",
    "Sony DualSense Edge": "Sony DualSense Edge",
    "Connected invalid device: ": "Conectado dispositivo incompatible: ",
    "Calibration of the DualSense Edge is not currently supported.": "Calibracion de DualSense Edge no está soportada, de momento...",
    "The device appears to be a DS4 clone. All functionalities are disabled.": "El dispositivo parece ser un clone DS4. Todas las funcionalidades estan desabilitadas",
    "Error: ": "Error: ",
    "My handle on discord is: the_al": "Mi identificador de discord es: the_al",
    "Initializing...": "Inicializando...",
    "Storing calibration...": "Guardando Calibración...",
    "Sampling...": "Muestra...",
    "Calibration in progress": "Calibración en proceso",
    "Start": "Empezar",
    "Continue": "Continuar",
    "You can check the calibration with the": "Puedes verificar tu calibración con",
    "Have a nice day :)": "Ten un buen dia! :)",
    "Welcome to the Calibration GUI": "Bienvenido a la Calibration GUI",
    "Just few things to know before you can start:": "Algunas cosas antes de empezar:", 
    "This website is not affiliated with Sony, PlayStation &amp; co.": "Esta web no esta afiliada con Sony, PlayStation &amp; co.",
    "This service is provided without warranty. Use at your own risk.": "Este servicio esta sin garantia. Usalo a tu propio riesgo. ", 
    "Keep the internal battery of the controller connected and ensure it is well charged. If the battery dies during operations, the controller will be damaged and rendered unusable.": "Ten la bateria del mando siempre conectada y asegurate que este cargada.Si la bateria muere durante las operaciones, el mando se quedará dañado y se quedará inutilizado",
    "Before doing the permanent calibration, try the temporary one to ensure that everything is working well.": "Antes de hacer un calibración permanente, prueba hacer una calibración temporal, para asegurar que todo funciona bien.",
    "Understood": "Entendido",
    "Version": "Version",

    "Frequently Asked Questions": "Preguntas Frecuentes",
    "Close": "Cerrar",
    "Welcome to the F.A.Q. section! Below, you'll find answers to some of the most commonly asked questions about this website. If you have any other inquiries or need further assistance, feel free to reach out to me directly. Your feedback and questions are always welcome!": "Bienvenido a la seccion F.A.Q.! Abajo va a encontrar las preguntas más frecuentes sobre esta web. Si tienes otros temas o necesitas más asistencia, siente libre de entrar en contacto directo conmigo. Tus comentarios y preguntas son siempre bienvenidas!",
    "How does it work?": "Como funciona?",
    "Behind the scenes, this website is the culmination of one year of dedicated effort in reverse-engineering DualShock controllers for fun/hobby from a random guy on the internet.": "Detras de esto, esta web es el culminar de un año de dedicacion y esfuerzo en ingeneria-reversa de DualShock por divertimiento/hobby de un individuo cualquier en internet.",
    "Through": "Através",
    "this research": "de esta investigación",
    ", it was discovered that there exist some undocumented commands on DualShock controllers that can be sent via USB and are used during factory assembly process. If these commands are sent, the controller starts the recalibration of analog sticks.": ", se ha descubierto que hay comandos indocumentados de los DualShock que se pueden enviar por USB y que se usan en la fabrica durante el proceso de montaje. Si estos comandos se envian el mando empieza a recalibrar los analógicos. ",
    "While the primary focus of this research wasn't initially centered on recalibration, it became apparent that a service offering this capability could greatly benefit numerous individuals. And thus, here we are.": "Mientras el enfoque inicial no era de centrar y recalibrar los analogicos, se observo que la capacidad que ofrecia a la capacidad de servicio beneficiava mucho a muchos individuos. Por eso, aqui estamos.",
    "Does the calibration remain effective during gameplay on PS4/PS5?": "La calibración se mantiene efectiva durante las partidas en PS4/Ps5?",
    "Yes, if you tick the checkbox \"Write changes permanently in the controller\". In that case, the calibration is flashed directly in the controller firmware. This ensures that it remains in place regardless of the console it's connected to.": "Si, si selecionas la casilla \"Guarda los cambios permanentemente en el mando\". En el caso, que la calibracion se ha flasheado directamente en el mando. Esto asegura que se mantenga independientemente de la consola a que se conecte.",
    "Is this an officially endorsed service?": "Es esto un servicio oficial?",
    "No, this service is simply a creation by a DualShock enthusiast.": "No, esto es una creacion de un amante de DualShock.",
    "Does this website detects if a controller is a clone?": "Esta web detecta si el mando es un clone?",
    "Yes, only DualShock4 at the moment. This happened because I accidentally purchased some clones, spent time identifying the differences and added this functionality to prevent future deception.": "Si, solo DualShock4 de momento. Esto pasa ya que acidentalmente compre algunos clones y me pase tiempo identificando las diferencias, y añadi la funcion para prevenir futuras decepciones.",
    "Unfortunately, the clones cannot be calibrated anyway, because they only clone the behavior of a DualShock4 during a normal gameplay, not all the undocumented functionalities.": "Desafortunadamente, los clones no se pueden calibrar, debido a que ellos clonan el comportamiento de un DualShock4 durante un juego normal, no todas las funciones indocumentadas.",
    "If you want to extend this detection functionality to DualSense, please ship me a fake DualSense and you'll see it in few weeks.": "Si quieres que se amplie esta detection enviame un Dualsense falso y lo vas a ver en unas semanas.",
    "What development is in plan?": "Cual el plan de desarrollo?",

    "I maintain two separate to-do lists for this project, although the priority has yet to be established.": "Mantengo dos listas separadas para este proyecto, si bien la prioridad aun esta por determinar.",
    "The first list is about enhancing support for DualShock4 and DualSense controllers:": "La primera lista es de dar soporte a mandos DualShock4 e DualSense:",
    "Implement calibration of L2/R2 triggers.": "Implementacion calibracion de gatillos L2/R2.",
    "Improve detection of clones, particularly beneficial for those seeking to purchase used controllers with assurance of authenticity.": "Mejora de deteccion de clones, particular en beneficio de quienes compren mandos y quieran asegurar su autenticidad.",
    "Enhance user interface (e.g. provide additional controller information)": "Mejorar interfaz de usuario (ej. proporcionar informacion adicional del mando)",
    "Add support for recalibrating IMUs.": "Añadir soporte de recalibracion de IMU.",
    "Additionally, explore the possibility of reviving non-functioning DualShock controllers (further discussion available on Discord for interested parties).": "Adicional, investigar la posibilidad de revivir mandos muertos DualShock (discucion disponible on Discord para grupos interesados).",
    "The second list contains new controllers I aim to support:": "La siguiente lista contiene los mandos que quiero dar soporte:",
    "DualSense Edge": "DualSense Edge",
    "DualShock 3": "DualShock 3",
    "XBox Controllers": "Controller Xbox",
    "Each of these tasks presents both immense interest and significant time investment. To provide context, supporting a new controller typically demands 6-12 months of full-time research, alongside a stroke of good fortune.": "Cada una de estas tareas demandan profundo interes y mucho tiempo de investigacion. Para entrar en contexto, dar soporte a un nuevo mando normalmente requiere 6-12 meses de investigacion a tiempo completo, con un golpe de buena suerte.",
    "I love this service, it helped me! How can I contribute?": "Me encantó este servicio, me ayudó mucho! Como puedo ayudar?",
    "I'm glad to hear that you found this helpful! If you're interested in contributing, here are a few ways you can help me:": "Me encanta escuchar que los has encontrado util! Si tienes ganas de apoyar, hay unas cuantas cosas para que me ayudes:",
    "Consider making a": "Considera hacer una ",
    "donation": "donacion",
    "to support my late-night caffeine-fueled reverse-engineering efforts.": "para ayudar mi velada-nocturna cafeina-cargada ingeneria-reversa esfuerzo.",
    "Ship me a controller you would love to add (send me an email for organization).": "Enviame un mando que te gustaria añadir (envia el email para organizar).",
    "Translate this website in your language": "Traduz esta web en tu idioma",
    ", to help more people like you!": ", para que ayude mas personas como tu!",
    "This website uses analytics to improve the service.": "Este sitio web utiliza análisis para mejorar el servicio.",

    "Board Model:": "",
    "This feature is experimental.": "",
    "Please let me know if the board model of your controller is not detected correctly.": "",
    "Board model detection thanks to": "",
    "Please connect the device using a USB cable.": "",
    "This DualSense controller has outdated firmware.": "",
    "Please update the firmware and try again.": "",

    "": ""
}
