{
    ".authorMsg": "- Traduction Française par <a href='https://github.com/Sadenki'>Cyrille Pugeault</a>",
    "DualShock Calibration GUI": "Interface de calibration DualShock",
    "Unsupported browser. Please use a web browser with WebHID support (e.g. Chrome).": "Navigateur incompatible. Merci d'utiliser un navigateur doté du support WebHID (e.x : Chrome)",
    "Connect a DualShock 4 or a DualSense controller to your computer and press Connect.": "Connecter une manette DualShock 4 ou DualSence à votre ordinateur et Appuyez sur Connecter",
    "Connect": "Connecter",
    "Connected to:": "Connecté à:",
    "Disconnect": "Déconnecter",
    "Firmware Info": "Information sur le Firmware",
    "Calibrate stick center": "Calibration centrage joystick",
    "Calibrate stick range (permanent)": "Calibration de la portée du joystick (permanente)",
    "Calibrate stick range (temporary)": "Calibration de la portée du joystick (temporaire)",
    "Reset controller": "Réinitialisé la manette",
    "Sections below are not useful, just some debug infos or manual commands": "La sections plus bas n'est pas utile, juste quelques informations de débug ou commande manuel",
    "NVS Status": "Status NVS",
    "Unknown": "Inconnue",
    "BD Addr": "Adresse BD",
    "Debug buttons": "Bouton Debug",
    "Query NVS status": "requête status NVS",
    "NVS unlock": "Débloquer NVS",
    "NVS lock": "Bloquer NVS",
    "Get BDAddr": "Obtenir BDAddr",
    "Fast calibrate stick center (OLD)": "Calibration rapide pour centrer le joystick (Ancienne méthode)",
    "Stick center calibration": "Calibration pour centrer le joystick",
    "Welcome": "Bienvenu",
    "Step 1": "Étape 1",
    "Step 2": "Étape 2",
    "Step 3": "Étape 3",
    "Step 4": "Étape 4",
    "Completed": "Terminé",
    "Welcome to the stick center-calibration wizard!": "Bienvenu dans l'assistant de calibration pour centrer du joystick",
    "This tool will guide you in re-centering the analog sticks of your controller. It consists in four steps: you will be asked to move both sticks in a direction and release them.": "Cette outil va vous guider afin de centrer à nouveau les joysticks de votre manette. Cela consiste en quatres étapes: nous allons vous demander de bouger les deux joysticks dans une direction puis de les relachers",
    "Please be aware that, <i>once the calibration is running, it cannot be canceled</i>. Do not close this page or disconnect your controller until is completed.": "Faite attention : <i>une fois le processus lancer, vous ne pouvez pas l'annuler</i>. Ne pas fermer cette page ou déconnecter la manette jusqu'à la fin du processus.",
    "Calibration storage": "Mémorisation des données de calibration",
    "By default the calibration is only saved in a volatile storage, so that if you (or this tool) mess something up, a reset of the controller is enough to make it work again.": "Par défault la calibration est sauvegardé dans des données volatile, de tel sorte que si vous (ou cet outil) venez à dégrader une fonction, une simple remise à zéro de la manette sera suffisant pour récuperer un fonctionnement normal.",
    "If you wish to store the calibration permanently in the controller, tick the checkbox below:": "Si vous souhaitez enregistrer la calibration du joystick de manière permanente, cocher la case plus bas:",
    "Write changes permanently in the controller": "Enregistrer de manière permanente les modifications dans la manette",
    "<small>Warning: <font color=\"red\">Do not store the calibration permanently if the controller battery is low or disconnected. It will damage your controller.</font></small>": "<small>Attention: <font color='red'>N'effectuez pas la calibration de manière permanente si la batterie de votre manette est faible ou déconnecté. Cela entrainerai des dommages irréversible sur votre manette.</font></small>",
    "Press <b>Start</b> to begin calibration.": "Appuyez sur <b>Démarrer</b> pour commencer le processus de calibration",
    "Please move both sticks to the <b>top-left corner</b> and release them.": "Merci de bouger les deux joysticks <b>en haut à gauche</b> puis relachez.",
    "When the sticks are back in the center, press <b>Continue</b>.": "Quand les deux joysticks sont revenue au centre, Appuyez sur <b>Continuer</b>",
    "Please move both sticks to the <b>top-right corner</b> and release them.": "Merci de bouger les deux joysticks <b>en haut à droite</b> puis relachez.",
    "Please move both sticks to the <b>bottom-left corner</b> and release them.": "Merci de bouger les deux joysticks <b>en bas à gauche</b> puis relachez.",
    "Please move both sticks to the <b>bottom-right corner</b> and release them.": "Merci de bouger les deux joysticks<b>en bas à droite</b> puis relachez.",
    "Calibration completed successfully!": "Calibration réussit avec succès!",
    "Next": "Suivant",
    "Recentering the controller sticks. ": "Recentrer les joysticks de la manette. ",
    "Please do not close this window and do not disconnect your controller. ": "Merci de ne pas fermer cette fenêtre ou déconnecter votre manette. ",
    "Range calibration": "Calibration de la portée du joystick ",
    "<b>The controller is now sampling data!</b>": "<b>La manette est maintenant en train d'échantillonner les données!</b>",
    "Rotate the sticks slowly to cover the whole range. Press \"Done\" when completed.": "Faite tourner doucement les joysticks afin d'atteindre la portée maximal. Appuyez sur \"Fait\" quand vous avez terminé.",
    "Done": "Fait",
    "Hi, thank you for using this software.": "Au revoir, merci d'avoir utilisé cet outil.",
    "If you're finding it helpful and you want to support my efforts, feel free to": "Si vous avez trouvé cette outil pratique et que vous souhaitez m'apporter du soutien dans mon travail, soyez libre de",
    "buy me a coffee": "m'offrir un café",
    "! :)": "! :)",
    "Do you have any suggestion or issue? Drop me a message via email or discord.": "Vous avez des suggéstions ou un problème? laissez moi un message par email ou sur discord.",
    "Cheers!": "A la prochaine!",
    "Support this project": "Apporter du soutien à ce projet",

    "unknown": "inconnue",
    "original": "original", 
    "clone": "clone", 
    "locked": "vérouillé",
    "unlocked": "dévérouillé",
    "error": "erreur",
    "Build Date:": "Date Build:",
    "HW Version:": "Version HW:",
    "SW Version:": "Version SW:",
    "Device Type:": "Device Device:",
    "Firmware Type:": "Type Firmware:",
    "SW Series:": "Serie SW:",
    "HW Info:": "Info HW:",
    "SW Version:": "Version SW:",
    "UPD Version:": "Version UPD:",
    "FW Version1:": "Version FW1:",
    "FW Version2:": "Version FW2:",
    "FW Version3:": "Version FW3:",

    "Range calibration completed": "Calibration de la portée réussit",
    "Range calibration failed: ": "Echec de la calibration de la portée: ",
    "Cannot unlock NVS": "Impossible de dévérouiller NVS", 
    "Cannot relock NVS": "Impossible de vérouiller NVS", 
    "Error 1": "Erreur 1",
    "Error 2": "Erreur 2",
    "Error 3": "Erreur 3",
    "Stick calibration failed: ": "Echec de la calibration du centrage des joysticks: ",
    "Stick calibration completed": "Calibration du centrage des joysticks terminé",
    "NVS Lock failed: ": "Echec du vérouillage NVS: ",
    "NVS Unlock failed: ": "Echec du dévérouillage NVS: ",
    "Please connect only one controller at time.": "Merci de ne connecter qu'une manette à la fois.",
    "Sony DualShock 4 V1": "Sony DualShock 4 V1",
    "Sony DualShock 4 V2": "Sony DualShock 4 V2",
    "Sony DualSense": "Sony DualSense",
    "Sony DualSense Edge": "Sony DualSense Edge",
    "Connected invalid device: ": "Connecté à un appareil non valide: ",
    "Calibration of the DualSense Edge is not currently supported.": "La calibration de la manette DualSense Edge n'est pas actuellement supportée",
    "The device appears to be a DS4 clone. All functionalities are disabled.": "Cet appareil semble être une contre-façon. Toutes les fonctionnalités sont désactivé",
    "Error: ": "Erreur: ",
    "My handle on discord is: the_al": "Mon ID sur discord est: the_al",
    "Initializing...": "Initialisation...",
    "Storing calibration...": "Sauvegarde de la calibration...",
    "Sampling...": "Échantillonnage...",
    "Calibration in progress": "Calibration en cours",
    "Start": "Commencer",
    "Done": "Terminer",
    "Continue": "Continuer",
    "You can check the calibration with the": "Vous pouvez vérifier la calibration avec le:",
    "Have a nice day :)": "On vous souhaite une bonne journée :)",
    "Welcome to the Calibration GUI": "Bienvenu dans l'assistant de calibration",
    "Just few things to know before you can start:": "Juste quelques petites information avant que nous commençons:", 
    "This website is not affiliated with Sony, PlayStation &amp; co.": "Ce site n'est pas affilié avec Sony, PlayStation &amp; co.",
    "This service is provided without warranty. Use at your own risk.": "Ce service est proposé sans garantie, à utiliser à vos risque et péril. ", 
    "Keep the internal battery of the controller connected and ensure it is well charged. If the battery dies during operations, the controller will be damaged and rendered unusable.": "Tieni sempre la batteria interna del controller collegata, e assicurati che sia carica. Se il controller si spegne durante le operazioni, diventerà inutilizzabile.",
    "Before doing the permanent calibration, try the temporary one to ensure that everything is working well.": "Avant de faire des modifications définitive, essayer la méthode temporaire afin de vous assurer que tout fonctionne comme il faut!",
    "Understood": "Compris",
    "Version": "Version",
    "": ""
}
