{
    ".authorMsg": "한국어 번역 : 제타",
    "DualShock Calibration GUI": "DualShock 보정 GUI",
    "Unsupported browser. Please use a web browser with WebHID support (e.g. Chrome).": "지원하지 않는 브라우저입니다. WebHID를 지원하는 웹 브라우저(예: Chrome)를 사용해주세요.",
    "Connect": "연결",
    "Connected to:": "연결된 기기:",
    "Disconnect": "연결 끊기",
    "Calibrate stick center": "스틱 중앙 보정",
    "Calibrate stick range": "스틱 범위 보정",
    "Sections below are not useful, just some debug infos or manual commands": "아래 항목은 디버그 정보와 수동 명령어로, 일반 사용자에게는 유용하지 않습니다.",
    "NVS Status": "NVS 상태",
    "Unknown": "알 수 없음",
    "Debug buttons": "디버그 버튼",
    "Query NVS status": "NVS 상태 조회",
    "NVS unlock": "NVS 잠금 해제",
    "NVS lock": "NVS 잠금",
    "Fast calibrate stick center (OLD)": "스틱 중앙 빠른 보정 (구버전)",
    "Stick center calibration": "스틱 중앙 보정",
    "Welcome": "환영합니다",
    "Step 1": "1단계",
    "Step 2": "2단계",
    "Step 3": "3단계",
    "Step 4": "4단계",
    "Completed": "완료",
    "Welcome to the stick center-calibration wizard!": "스틱 중앙 보정 마법사에 오신 것을 환영합니다!",
    "This tool will guide you in re-centering the analog sticks of your controller. It consists in four steps: you will be asked to move both sticks in a direction and release them.": "이 도구는 컨트롤러 아날로그 스틱의 중앙을 다시 설정하는 과정을 안내합니다. 총 4단계로 구성되며, 각 단계마다 양쪽 스틱을 특정 방향으로 움직였다가 놓으라는 안내가 표시됩니다.",
    "Please be aware that, <i>once the calibration is running, it cannot be canceled</i>. Do not close this page or disconnect your controller until is completed.": "<i>보정이 시작되면 취소할 수 없습니다</i>. 완료될 때까지 이 페이지를 닫거나 컨트롤러 연결을 해제하지 마십시오.",
    "Press <b>Start</b> to begin calibration.": "<b>시작</b>을 눌러 보정을 시작하세요.",
    "Please move both sticks to the <b>top-left corner</b> and release them.": "양쪽 스틱을 <b>왼쪽 위</b> 방향으로 끝까지 민 다음 놓아주세요.",
    "When the sticks are back in the center, press <b>Continue</b>.": "스틱이 중앙으로 돌아오면 <b>계속</b> 버튼을 누르세요.",
    "Please move both sticks to the <b>top-right corner</b> and release them.": "양쪽 스틱을 <b>오른쪽 위</b> 방향으로 끝까지 민 다음 놓아주세요.",
    "Please move both sticks to the <b>bottom-left corner</b> and release them.": "양쪽 스틱을 <b>왼쪽 아래</b> 방향으로 끝까지 민 다음 놓아주세요.",
    "Please move both sticks to the <b>bottom-right corner</b> and release them.": "양쪽 스틱을 <b>오른쪽 아래</b> 방향으로 끝까지 민 다음 놓아주세요.",
    "Calibration completed successfully!": "보정이 성공적으로 완료되었습니다!",
    "Next": "다음",
    "Recentering the controller sticks.": "컨트롤러 스틱 중앙을 다시 설정하는 중입니다.",
    "Please do not close this window and do not disconnect your controller. ": "이 창을 닫거나 컨트롤러 연결을 해제하지 마십시오.",
    "Range calibration": "범위 보정",
    "<b>The controller is now sampling data!</b>": "<b>컨트롤러가 데이터 샘플링을 시작했습니다!</b>",
    "Rotate the sticks slowly to cover the whole range. Press \"Done\" when completed.": "스틱을 천천히 돌려 전체 범위를 인식시키세요. 완료되면 <b>완료</b>를 누르세요.",
    "Done": "완료",
    "Hi, thank you for using this software.": "안녕하세요, 저희 소프트웨어를 이용해 주셔서 감사합니다.",
    "If you're finding it helpful and you want to support my efforts, feel free to": "이 프로그램이 도움이 되었고, 개발자를 응원하고 싶으시다면",
    "buy me a coffee": "커피 한 잔 사주세요",
    "! :)": "! :)",
    "Do you have any suggestion or issue? Drop me a message via email or discord.": "제안이나 문제가 있으신가요? 이메일이나 Discord로 메시지를 보내주세요.",
    "Cheers!": "감사합니다!",
    "Support this project": "프로젝트 후원하기",
    "unknown": "알 수 없음",
    "original": "정품",
    "clone": "복제품",
    "locked": "잠김",
    "unlocked": "잠금 해제",
    "error": "오류",
    "Build Date": "빌드 날짜",
    "HW Version": "하드웨어 버전",
    "SW Version": "소프트웨어 버전",
    "Device Type": "기기 종류",
    "Range calibration completed": "범위 보정이 완료되었습니다.",
    "Range calibration failed": "범위 보정에 실패했습니다",
    "Cannot unlock NVS": "NVS를 잠금 해제할 수 없습니다.",
    "Cannot relock NVS": "NVS를 다시 잠글 수 없습니다.",
    "Error 1": "오류 1",
    "Error 2": "오류 2",
    "Error 3": "오류 3",
    "Stick calibration failed": "스틱 보정에 실패했습니다",
    "Stick calibration completed": "스틱 보정이 완료되었습니다.",
    "NVS Lock failed": "NVS 잠금에 실패했습니다",
    "NVS Unlock failed": "NVS 잠금 해제에 실패했습니다",
    "Please connect only one controller at time.": "한 번에 하나의 컨트롤러만 연결해주세요.",
    "Sony DualShock 4 V1": "Sony DualShock 4 V1",
    "Sony DualShock 4 V2": "Sony DualShock 4 V2",
    "Sony DualSense": "Sony DualSense",
    "Sony DualSense Edge": "Sony DualSense Edge",
    "Connected invalid device: ": "잘못된 기기가 연결되었습니다:",
    "The device appears to be a DS4 clone. All functionalities are disabled.": "이 기기는 DS4 복제품으로 보입니다. 모든 기능이 비활성화됩니다.",
    "Error: ": "오류:",
    "My handle on discord is: the_al": "제 Discord ID는 the_al 입니다.",
    "Initializing...": "초기화 중...",
    "Storing calibration...": "보정 값 저장 중...",
    "Sampling...": "샘플링 중...",
    "Calibration in progress": "보정 진행 중",
    "Start": "시작",
    "Continue": "계속",
    "You can check the calibration with the": "다음을 통해 보정 상태를 확인할 수 있습니다:",
    "Have a nice day :)": "좋은 하루 되세요 :)",
    "Welcome to the Calibration GUI": "보정 GUI에 오신 것을 환영합니다",
    "Just few things to know before you can start:": "시작하기 전에 몇 가지 알아둘 사항이 있습니다:",
    "This website is not affiliated with Sony, PlayStation &amp; co.": "이 웹사이트는 Sony, PlayStation 및 관련사와 아무런 관련이 없습니다.",
    "This service is provided without warranty. Use at your own risk.": "이 서비스는 어떠한 보증도 제공하지 않으며, 사용에 대한 책임은 본인에게 있습니다.",
    "Keep the internal battery of the controller connected and ensure it is well charged. If the battery dies during operations, the controller will be damaged and rendered unusable.": "컨트롤러의 내장 배터리가 연결되어 있고 충분히 충전되었는지 확인하세요. 작업 중 배터리가 방전되면 컨트롤러가 손상되어 사용할 수 없게 될 수 있습니다.",
    "Before doing the permanent calibration, try the temporary one to ensure that everything is working well.": "영구 보정을 진행하기 전에, 임시 보정을 먼저 시도하여 모든 것이 정상적으로 작동하는지 확인하세요.",
    "Understood": "이해했습니다",
    "Version": "버전",
    "Frequently Asked Questions": "자주 묻는 질문",
    "Close": "닫기",
    "Welcome to the F.A.Q. section! Below, you'll find answers to some of the most commonly asked questions about this website. If you have any other inquiries or need further assistance, feel free to reach out to me directly. Your feedback and questions are always welcome!": "자주 묻는 질문(F.A.Q.)에 오신 것을 환영합니다! 아래에서 이 웹사이트에 대해 자주 묻는 질문과 답변을 확인하실 수 있습니다. 다른 문의사항이나 추가 지원이 필요하시면 언제든지 직접 연락해주세요. 여러분의 피드백과 질문을 언제나 환영합니다!",
    "How does it work?": "어떻게 작동하나요?",
    "Behind the scenes, this website is the culmination of one year of dedicated effort in reverse-engineering DualShock controllers for fun/hobby from a random guy on the internet.": "이 웹사이트는 인터넷의 한 유저가 1년 동안 재미와 취미로 DualShock 컨트롤러를 리버스 엔지니어링한 노력의 결실입니다.",
    "this research": "이 연구",
    ", it was discovered that there exist some undocumented commands on DualShock controllers that can be sent via USB and are used during factory assembly process. If these commands are sent, the controller starts the recalibration of analog sticks.": "를 통해 DualShock 컨트롤러에 문서화되지 않은 특정 명령어가 존재하며, 이 명령어는 USB를 통해 전송되어 공장 조립 과정에서 사용된다는 사실이 발견되었습니다. 이 명령어를 전송하면 컨트롤러가 아날로그 스틱 재보정을 시작합니다.",
    "While the primary focus of this research wasn't initially centered on recalibration, it became apparent that a service offering this capability could greatly benefit numerous individuals. And thus, here we are.": "처음에는 재보정이 이 연구의 주된 초점은 아니었지만, 이 기능을 제공하는 서비스가 많은 사람들에게 큰 도움이 될 수 있다는 사실이 명확해졌습니다. 그래서 이 웹사이트를 만들게 되었습니다.",
    "Does the calibration remain effective during gameplay on PS4/PS5?": "PS4/PS5에서 게임을 할 때도 보정 효과가 유지되나요?",
    "Yes, if you tick the checkbox \"Write changes permanently in the controller\". In that case, the calibration is flashed directly in the controller firmware. This ensures that it remains in place regardless of the console it's connected to.": "네, \"변경 사항을 컨트롤러에 영구적으로 저장\" 체크박스를 선택하면 됩니다. 이 경우 보정 값이 컨트롤러 펌웨어에 직접 저장되어, 어떤 콘솔에 연결하든 설정이 유지됩니다.",
    "Is this an officially endorsed service?": "이것은 공식적으로 인증된 서비스인가요?",
    "No, this service is simply a creation by a DualShock enthusiast.": "아니요, 이 서비스는 한 DualShock 팬이 만든 개인적인 창작물입니다.",
    "Does this website detects if a controller is a clone?": "이 웹사이트는 컨트롤러가 복제품인지 감지할 수 있나요?",
    "Yes, only DualShock4 at the moment. This happened because I accidentally purchased some clones, spent time identifying the differences and added this functionality to prevent future deception.": "네, 현재로서는 DualShock 4만 감지할 수 있습니다. 제가 실수로 복제품을 구매하게 되어, 차이점을 파악하는 데 시간을 투자했고, 앞으로 다른 사람들이 속지 않도록 이 기능을 추가했습니다.",
    "Unfortunately, the clones cannot be calibrated anyway, because they only clone the behavior of a DualShock4 during a normal gameplay, not all the undocumented functionalities.": "안타깝게도 복제품은 보정이 불가능합니다. 일반적인 게임 플레이 동작만 복제할 뿐, 문서화되지 않은 모든 기능까지 복제하지는 않기 때문입니다.",
    "If you want to extend this detection functionality to DualSense, please ship me a fake DualSense and you'll see it in few weeks.": "DualSense 복제품 감지 기능 추가를 원하신다면, 저에게 가짜 DualSense를 보내주세요. 몇 주 안에 기능을 추가해 드리겠습니다.",
    "What development is in plan?": "어떤 개발 계획이 있나요?",
    "I maintain two separate to-do lists for this project, although the priority has yet to be established.": "이 프로젝트에는 두 개의 별도 할 일 목록이 있으며, 아직 우선순위는 정해지지 않았습니다.",
    "The first list is about enhancing support for DualShock4 and DualSense controllers:": "첫 번째 목록은 DualShock 4 및 DualSense 컨트롤러 지원 강화에 관한 것입니다:",
    "Implement calibration of L2/R2 triggers.": "L2/R2 트리거 보정 기능 구현",
    "Improve detection of clones, particularly beneficial for those seeking to purchase used controllers with assurance of authenticity.": "복제품 탐지 기능 개선 (특히 정품 인증이 필요한 중고 컨트롤러 구매자에게 유용)",
    "Enhance user interface (e.g. provide additional controller information)": "사용자 인터페이스 개선 (예: 추가 컨트롤러 정보 제공)",
    "Add support for recalibrating IMUs.": "IMU 재보정 지원 추가",
    "Additionally, explore the possibility of reviving non-functioning DualShock controllers (further discussion available on Discord for interested parties).": "또한, 작동하지 않는 DualShock 컨트롤러를 되살릴 수 있는 가능성 탐색 (관심 있는 분들은 Discord에서 추가 논의 가능)",
    "The second list contains new controllers I aim to support:": "두 번째 목록은 앞으로 지원할 새로운 컨트롤러들입니다:",
    "DualSense Edge": "DualSense Edge",
    "DualShock 3": "DualShock 3",
    "XBox Controllers": "Xbox 컨트롤러",
    "Each of these tasks presents both immense interest and significant time investment. To provide context, supporting a new controller typically demands 6-12 months of full-time research, alongside a stroke of good fortune.": "각 작업은 매우 흥미롭지만 상당한 시간 투자가 필요합니다. 새로운 컨트롤러를 지원하려면 보통 6~12개월의 전담 연구와 약간의 행운이 필요합니다.",
    "I love this service, it helped me! How can I contribute?": "이 서비스 정말 마음에 들어요, 큰 도움이 됐습니다! 어떻게 기여할 수 있나요?",
    "I'm glad to hear that you found this helpful! If you're interested in contributing, here are a few ways you can help me:": "도움이 되셨다니 기쁩니다! 기여하고 싶으시다면 다음과 같은 방법으로 저를 도울 수 있습니다:",
    "Consider making a": "다음과 같은",
    "donation": "기부",
    "to support my late-night caffeine-fueled reverse-engineering efforts.": "를 통해 카페인으로 버티는 저의 밤샘 리버스 엔지니어링 작업을 응원해주세요.",
    "Ship me a controller you would love to add (send me an email for organization).": "추가하고 싶은 컨트롤러가 있다면 저에게 보내주세요 (자세한 내용은 이메일로 문의).",
    "Translate this website in your language": "이 웹사이트를 당신의 언어로 번역해주세요",
    ", to help more people like you!": ", 당신과 같은 더 많은 사람들을 돕기 위해!",
    "This website uses analytics to improve the service.": "이 웹사이트는 서비스 개선을 위해 분석 도구를 사용합니다.",
    "Board Model": "보드 모델",
    "This feature is experimental.": "이 기능은 실험적인 기능입니다.",
    "Please let me know if the board model of your controller is not detected correctly.": "컨트롤러의 보드 모델이 올바르게 감지되지 않으면 알려주세요.",
    "Board model detection thanks to": "보드 모델 감지 도움:",
    "This DualSense controller has outdated firmware.": "이 DualSense 컨트롤러의 펌웨어가 오래되었습니다.",
    "Please update the firmware and try again.": "펌웨어를 업데이트한 후 다시 시도해주세요.",
    "Joystick Info": "조이스틱 정보",
    "Check circularity": "원형성 확인",
    "Can I reset a permanent calibration to previous calibration?": "영구 보정을 이전 보정 값으로 되돌릴 수 있나요?",
    "No.": "아니요.",
    "Can you overwrite a permanent calibration?": "영구 보정을 덮어쓸 수 있나요?",
    "Yes. Simply do another permanent calibration.": "네, 영구 보정을 다시 실행하면 됩니다.",
    "Does this software resolve stickdrift?": "이 소프트웨어로 스틱 쏠림 현상을 해결할 수 있나요?",
    "Stickdrift is caused by a physical defect; namely dirt, worn potentiometer or in some cases a worn spring.": "스틱 쏠림은 먼지, 마모된 전위차계(포텐셔미터) 또는 마모된 스프링과 같은 물리적 결함으로 인해 발생합니다.",
    "This software will not fix stick drift on its own if you already experience that. What it will help with, is ensuring the new joystick(s) will function properly after replacing the old one(s) to work well with.": "이미 스틱 쏠림을 겪고 있다면 이 소프트웨어만으로는 해결되지 않습니다. 하지만 낡은 조이스틱을 교체한 후 새 조이스틱이 제대로 작동하도록 보정하는 데 도움이 될 수 있습니다.",
    "I have noticed some controllers out of the box have worse factory calibration than if I would recalibrate them. Especially true for circularity of SCUF controllers with a unique shell.": "일부 컨트롤러는 공장 출고 상태보다 재보정했을 때 더 나은 성능을 보였습니다. 특히 독특한 셸을 가진 SCUF 컨트롤러의 원형성에서 더욱 그렇습니다.",
    "(Dualsense) Will updating the firmware reset calibration?": "(DualSense) 펌웨어를 업데이트하면 보정 값이 초기화되나요?",
    "After range calibration, joysticks always go in corners.": "범위 보정 후 조이스틱이 항상 가장자리로 쏠려요.",
    "This issue happens because you have clicked \"Done\" immediately after starting a range calibration.": "이 문제는 범위 보정을 시작하자마자 \"완료\"를 클릭했기 때문에 발생합니다.",
    "Please read the instructions.": "안내를 제대로 읽어주세요.",
    "You have to rotate the joysticks before you press \"Done\".": "\"완료\"를 누르기 전에 조이스틱을 돌려야 합니다.",
    "Make sure to touch the edges of the joystick frame and rotate slowly, preferably in each direction - clockwise and anti-clockwise.": "조이스틱 프레임 가장자리까지 닿도록 천천히, 가급적 시계 방향과 시계 반대 방향으로 모두 돌려주세요.",
    "Only after you have done that, you click on \"Done\".": "그 과정을 마친 후에 \"완료\"를 클릭해야 합니다.",
    "Changes saved successfully": "변경 사항이 성공적으로 저장되었습니다.",
    "Error while saving changes": "변경 사항 저장 중 오류 발생",
    "Save changes permanently": "변경 사항 영구 저장",
    "Reboot controller": "컨트롤러 재부팅",
    "Controller Info": "컨트롤러 정보",
    "Debug Info": "디버그 정보",
    "Software": "소프트웨어",
    "Hardware": "하드웨어",
    "FW Build Date": "펌웨어 빌드 날짜",
    "FW Type": "펌웨어 타입",
    "FW Series": "펌웨어 시리즈",
    "FW Version": "펌웨어 버전",
    "FW Update": "펌웨어 업데이트",
    "FW Update Info": "펌웨어 업데이트 정보",
    "SBL FW Version": "SBL 펌웨어 버전",
    "Venom FW Version": "Venom 펌웨어 버전",
    "Spider FW Version": "Spider 펌웨어 버전",
    "Touchpad FW Version": "터치패드 펌웨어 버전",
    "Serial Number": "시리얼 번호",
    "MCU Unique ID": "MCU 고유 ID",
    "PCBA ID": "PCBA ID",
    "Battery Barcode": "배터리 바코드",
    "VCM Left Barcode": "VCM 왼쪽 바코드",
    "VCM Right Barcode": "VCM 오른쪽 바코드",
    "HW Model": "하드웨어 모델",
    "Touchpad ID": "터치패드 ID",
    "Bluetooth Address": "블루투스 주소",
    "Show all": "모두 보기",
    "(beta)": "(베타)",
    "10x zoom": "10배 줌",
    "30th Anniversary": "30주년 기념",
    "<b>Externally</b>: by applying +1.8V directly to the visible test point without opening the controller.": "<b>외부에서</b>: 컨트롤러를 분해하지 않고 보이는 테스트 포인트에 직접 +1.8V를 인가합니다.",
    "<b>Internally</b>: by soldering a wire from a +1.8V source to the write-protect TP.": "<b>내부에서</b>: +1.8V 소스에서 쓰기 방지 TP까지 와이어를 납땜합니다.",
    "Astro Bot": "아스트로 봇",
    "Calibration": "보정",
    "Calibration is being stored in the stick modules.": "보정 값이 스틱 모듈에 저장되고 있습니다.",
    "Cancel": "취소",
    "Cannot lock": "잠글 수 없음",
    "Cannot store data into": "데이터를 저장할 수 없음:",
    "Cannot unlock": "잠금 해제할 수 없음",
    "Center (L1)": "중앙 (L1)",
    "Center X": "중앙 X",
    "Center Y": "중앙 Y",
    "Chroma Indigo": "크로마 인디고",
    "Chroma Pearl": "크로마 펄",
    "Chroma Teal": "크로마 틸",
    "Circularity (R1)": "원형성 (R1)",
    "Cobalt Blue": "코발트 블루",
    "Color": "색상",
    "Color detection thanks to": "색상 감지 도움:",
    "Cosmic Red": "코스믹 레드",
    "Debug": "디버그",
    "DualSense Edge Calibration": "DualSense Edge 보정",
    "Error triggering rumble": "진동 활성화 오류",
    "Finetune stick calibration": "스틱 보정 미세 조정",
    "For more info or help, feel free to reach out on Discord.": "더 많은 정보나 도움이 필요하시면 Discord로 문의해주세요.",
    "Fortnite": "포트나이트",
    "Galactic Purple": "갤럭틱 퍼플",
    "God of War Ragnarok": "갓 오브 워 라그나로크",
    "Grey Camouflage": "그레이 카무플라주",
    "I'm actively working on adding compatibility, the primary challenge lies in storing data into the stick modules.": "호환성 추가 작업을 적극적으로 진행 중이며, 주된 과제는 스틱 모듈에 데이터를 저장하는 것입니다.",
    "If the calibration is not stored permanently, please double-check the wirings of the hardware mod.": "보정 값이 영구적으로 저장되지 않으면 하드웨어 개조 배선을 다시 확인해주세요.",
    "If this tool has been helpful to you or you want to see DualSense Edge support arrive faster, please consider supporting the project with a": "이 도구가 도움이 되었거나 DualSense Edge 지원이 더 빨리 이루어지기를 바란다면, 다음을 통해 프로젝트를 후원하는 것을 고려해주세요:",
    "Info": "정보",
    "Left Module Barcode": "왼쪽 모듈 바코드",
    "Left stick": "왼쪽 스틱",
    "Midnight Black": "미드나이트 블랙",
    "More details and images": "자세한 내용 및 이미지 더보기",
    "Move the stick to select it for tuning, then without touching the stick use the D-pad buttons to adjust the center point. Flick it and adjust it again if it is off center or flickers.": "스틱을 움직여 조정할 스틱을 선택한 다음, 스틱을 만지지 않은 상태에서 D-패드 버튼을 사용하여 중앙점을 조정하세요. 스틱을 튕겨보고 중앙에서 벗어나거나 흔들리면 다시 조정하세요.",
    "Normal": "일반",
    "Nova Pink": "노바 핑크",
    "Please connect a DualShock 4, a DualSense or DualSense Edge controller to your computer and press Connect.": "DualShock 4, DualSense 또는 DualSense Edge 컨트롤러를 컴퓨터에 연결하고 '연결'을 누르세요.",
    "Please note: the stick modules on the DS Edge <b>cannot be calibrated via software alone</b>.To store a custom calibration on the stick's internal memory, a <b>hardware modification</b> is required.": "참고: DS Edge의 스틱 모듈은 <b>소프트웨어만으로는 보정할 수 없습니다</b>. 스틱 내부 메모리에 사용자 지정 보정 값을 저장하려면 <b>하드웨어 개조</b>가 필요합니다.",
    "Please release the stick to center position before adjusting with D-pad buttons.": "D-패드 버튼으로 조정하기 전에 스틱을 중앙 위치에 놓아주세요.",
    "Press L2 to test the strong (left) haptic motor": "L2를 눌러 강한 (왼쪽) 햅틱 모터를 테스트하세요",
    "Press R2 to test the weak (right) haptic motor": "R2를 눌러 약한 (오른쪽) 햅틱 모터를 테스트하세요",
    "Press the D-pad or face buttons in the direction you want the stick position to move.": "스틱 위치를 이동시키고 싶은 방향으로 D-패드나 페이스 버튼을 누르세요.",
    "Push the stick straight up/down/left/right as far as possible.": "스틱을 위/아래/왼쪽/오른쪽으로 최대한 밀어주세요.",
    "Right Module Barcode": "오른쪽 모듈 바코드",
    "Right stick": "오른쪽 스틱",
    "Save": "저장",
    "Show raw numbers": "원시 데이터 보기",
    "Spider-Man 2": "스파이더맨 2",
    "Starlight Blue": "스타라이트 블루",
    "Sterling Silver": "스털링 실버",
    "Support for calibrating DualSense Edge stick modules is now available as an <b>experimental feature</b>.": "DualSense Edge 스틱 모듈 보정 지원이 이제 <b>실험적인 기능</b>으로 제공됩니다.",
    "Test the Haptic Motors": "햅틱 모터 테스트",
    "Tests": "테스트",
    "Thank you for your generosity and support!": "너그러운 후원에 진심으로 감사드립니다!",
    "The DualShock Calibration GUI does not currently support the DualSense Edge.": "DualShock 보정 GUI는 현재 DualSense Edge를 지원하지 않습니다.",
    "The Last of Us": "더 라스트 오브 어스",
    "The motor strength will match how hard you press the trigger": "트리거를 누르는 강도에 따라 모터의 세기가 조절됩니다.",
    "This involves temporarily disabling write protection by applying <b>+1.8V</b> to a specific test point on each module.": "이를 위해서는 각 모듈의 특정 테스트 포인트에 <b>+1.8V</b>를 인가하여 쓰기 방지를 일시적으로 비활성화해야 합니다.",
    "This is only for advanced users. If you're not sure what you're doing, please do not attempt it.": "이 기능은 고급 사용자 전용입니다. 잘 모르는 경우 시도하지 마십시오.",
    "This screen allows to finetune raw calibration data on your controller": "이 화면에서 컨트롤러의 원시 보정 데이터를 미세 조정할 수 있습니다.",
    "Volcanic Red": "볼캐닉 레드",
    "We are not responsible for any damage caused by attempting this modification.": "이 개조 시도로 인해 발생하는 어떠한 손상에 대해서도 책임지지 않습니다.",
    "While holding the stick to be adjusted straight up/down/left/right, <em>observe the highlighted value below the circle</em>, then use the D-pad buttons to adjust the value to ±0.99 (just below ±1.00).": "조정할 스틱을 위/아래/왼쪽/오른쪽으로 똑바로 잡은 상태에서 <em>원 아래에 강조 표시된 값</em>을 확인한 다음 D-패드 버튼을 사용하여 값을 ±0.99(±1.00 바로 아래)로 조정하세요.",
    "White": "화이트",
    "You can do this in two ways:": "두 가지 방법으로 할 수 있습니다:",
    "here": "여기",
    "left module": "왼쪽 모듈",
    "right module": "오른쪽 모듈",
    "The device is connected via Bluetooth. Disconnect and reconnect using a USB cable instead.": "",
    "Through": "",
    "Your device might not be a genuine Sony controller. If it is not a clone then please report this issue.": "",
    "": ""
}