{
    ".authorMsg": "- Tradução para Português de Portugal realizada por @dualsense_no_drift :)",
    "DualShock Calibration GUI": "GUI Calibração de DualShock",
    "Unsupported browser. Please use a web browser with WebHID support (e.g. Chrome).": "Navegador não suportado. Por favor, use um navegador de web com suporte ao WebHID (por exemplo, Chrome).",
    "Connect": "Conectar",
    "Connected to:": "Conectado a:",
    "Disconnect": "Desconectar",
    "Calibrate stick center": "Calibrar o centro do joystick",
    "Calibrate stick range": "Calibrar o alcançe do joystick",
    "Sections below are not useful, just some debug infos or manual commands": "As seções abaixo não são úteis, apenas algumas informações de depuração ou comandos manuais",
    "NVS Status": "Status NVS",
    "Unknown": "Desconhecido",
    "Query NVS status": "Consultar status NVS",
    "NVS unlock": "Desbloquear NVS",
    "NVS lock": "Bloquear NVS",
    "Stick center calibration": "Calibração do centro do joystick",
    "Welcome": "Bem-vindo",
    "Step 1": "Passo 1",
    "Step 2": "Passo 2",
    "Step 3": "Passo 3",
    "Step 4": "Passo 4",
    "Completed": "Concluído",
    "Welcome to the stick center-calibration wizard!": "Bem-vindo ao assistente de calibração de centro dos joysticks!",
    "This tool will guide you in re-centering the analog sticks of your controller. It consists of four steps: you will be asked to move both sticks in a direction and release them.": "Esta ferramenta irá guiá-lo para recentrar os joysticks do controlador. Consiste em quatro etapas: onde será solicitado que mova ambos os joysticks numa direção e que os solte.",
    "Please be aware that, <i>once the calibration is running, it cannot be canceled</i>. Do not close this page or disconnect your controller until it is completed.": "Esteja ciente de que, <i>quando a calibração iniciar, não poderá ser cancelada</i>. Não feche esta página ou desconecte o controlador, até que a calibração estar concluída.",
    "Press <b>Start</b> to begin calibration.": "Pressione <b>Iniciar</b> para começar a calibração.",
    "Please move both sticks to the <b>top-left corner</b> and release them.": "Mova ambos os joysticks para o <b>canto superior esquerdo</b> e solte-os.",
    "When the sticks are back in the center, press <b>Continue</b>.": "Quando os joysticks voltarem ao centro, pressione <b>Continuar</b>.",
    "Please move both sticks to the <b>top-right corner</b> and release them.": "Mova ambos os joysticks para o <b>canto superior direito</b> e solte-os.",
    "Please move both sticks to the <b>bottom-left corner</b> and release them.": "Mova ambos os joysticks para o <b>canto inferior esquerdo</b> e solte-os.",
    "Please move both sticks to the <b>bottom-right corner</b> and release them.": "Mova ambos os joysticks para o <b>canto inferior direito</b> e solte-os.",
    "Calibration completed successfully!": "Calibração concluída com sucesso!",
    "Next": "Próximo",
    "Recentering the controller sticks.": "A recentrar os manípulos do controlador.",
    "Please do not close this window and do not disconnect your controller. ": "Por favor, não feche esta janela e não desconecte o seu controlador. ",
    "Range calibration": "Calibração de alcançe",
    "<b>The controller is now sampling data!</b>": "<b>O controlador está agora a recolher dados!</b>",
    "Done": "Concluído",
    "Hi, thank you for using this software.": "Olá, obrigado por usar este software.",
    "If you're finding it helpful and you want to support my efforts, feel free to": "Se está a achar útil e quiser suportar-me os esforços, sinta-se à vontade para",
    "buy me a coffee": "comprar-me um café",
    "! :)": "! :)",
    "Do you have any suggestion or issue? Drop me a message via email or discord.": "Tem alguma sugestão ou problema? Envie-me mensagem por e-mail ou discord.",
    "Cheers!": "Saúde!",
    "Support this project": "Apoie este projeto",
    "unknown": "desconhecido",
    "original": "original",
    "clone": "clone",
    "locked": "bloqueado",
    "unlocked": "desbloqueado",
    "error": "erro",
    "Build Date": "Data de Compilação",
    "HW Version": "Versão HW",
    "SW Version": "Versão SW",
    "Device Type": "Tipo de Dispositivo",
    "Range calibration completed": "Calibração de alcance completa",
    "Range calibration failed": "Calibração de alcance falhou",
    "Stick calibration failed": "Calibração do joystick falhou",
    "Stick calibration completed": "Calibração do joystick completa",
    "NVS Lock failed": "Bloqueio de NVS falhou",
    "NVS Unlock failed": "Desbloqueio de NVS falhou",
    "Please connect only one controller at time.": "Por favor, ligue apenas um controlador de cada vez.",
    "Sony DualShock 4 V1": "Sony DualShock 4 V1",
    "Sony DualShock 4 V2": "Sony DualShock 4 V2",
    "Sony DualSense": "Sony DualSense",
    "Sony DualSense Edge": "Sony DualSense Edge",
    "Connected invalid device": "Dispositivo inválido ligado",
    "The device appears to be a clone. All calibration functionality is disabled.": "",
    "Error": "Erro",
    "My handle on discord is: the_al": "Meu nome de utilizador no Discord é: the_al",
    "Initializing...": "Iniciando...",
    "Storing calibration...": "Armazenando a calibração...",
    "Sampling...": "Amostragem...",
    "Calibration in progress": "Calibração em progresso",
    "Start": "Inicio",
    "Continue": "Continuar",
    "You can check the calibration with the": "Pode verificar a calibração com o",
    "Have a nice day :)": "Tenha um bom dia :)",
    "Welcome to the Calibration GUI": "Bem-vindo à GUI de Calibração",
    "Just few things to know before you can start:": "Algumas coisas que precisa de saber antes de começar:",
    "This website is not affiliated with Sony, PlayStation &amp; co.": "Este website não é afiliado à Sony, PlayStation &amp; co.",
    "This service is provided without warranty. Use at your own risk.": "Este serviço não oferece garantia. Utilize por sua conta e risco.",
    "Keep the internal battery of the controller connected and ensure it is well charged. If the battery dies during operations, the controller will be damaged and rendered unusable.": "Mantenha a bateria interna do controlador conectada e certefique-se que esteja bem carregada. Se a bateria se esgotar durante as operações, o controlador será danificado e ficará inutilizável.",
    "Before doing the permanent calibration, try the temporary one to ensure that everything is working well.": "Antes de fazer a calibração permanente, experimente a temporária para garantir que está tudo a funcionar corretamente.",
    "Understood": "Entendido",
    "Version": "Versão",
    "Frequently Asked Questions": "Perguntas Frequentes",
    "Close": "Fechar",
    "Welcome to the F.A.Q. section! Below, you'll find answers to some of the most commonly asked questions about this website. If you have any other inquiries or need further assistance, feel free to reach out to me directly. Your feedback and questions are always welcome!": "Bem-vindo à seção de Perguntas Frequentes (F.A.Q.)! Abaixo, encontrará as respostas para algumas das perguntas mais comuns sobre este site. Caso tenha alguma outra dúvida ou necessite de mais assistência, sinta-se à vontade para entrar em contato diretamente comigo. O seu feedback e perguntas são sempre bem-vindos!!",
    "How does it work?": "Como funciona?",
    "Behind the scenes, this website is the culmination of one year of dedicated effort in reverse-engineering DualShock controllers for fun/hobby from a random guy on the internet.": "Nos bastidores, este site é o resultado de um ano de esforço dedicado à engenharia inversa nos controladores DualShock por diversão/hobby de um tipo aleatório na internet.",
    "Through": "Através",
    "this research": "esta pesquisa",
    ", it was discovered that there exist some undocumented commands on DualShock controllers that can be sent via USB and are used during factory assembly process. If these commands are sent, the controller starts the recalibration of analog sticks.": ", descobriu-se que existem alguns comandos não documentados nos controladores DualShock que podem ser enviados via USB e são utilizados durante o processo de montagem de fábrica. Se estes comandos forem enviados, o controlador inicia a recalibração dos joysticks.",
    "While the primary focus of this research wasn't initially centered on recalibration, it became apparent that a service offering this capability could greatly benefit numerous individuals. And thus, here we are.": "Embora o foco principal desta pesquisa não fosse inicialmente centrado na recalibração,  tornou-se evidente que um serviço que oferecesse esta capacidade poderia beneficiar imenso inúmeras pessoas. E, portanto, aqui estamos.",
    "Does the calibration remain effective during gameplay on PS4/PS5?": "A calibração permanece eficaz durante o jogo no PS4/PS5?",
    "Yes, if you tick the checkbox \"Write changes permanently in the controller\". In that case, the calibration is flashed directly in the controller firmware. This ensures that it remains in place regardless of the console it's connected to.": "Sim, se marcar a caixa de seleção \"Gravar mudanças permanentemente no controlador\". Nesse caso, a calibração é gravada diretamente no firmware do controlador. Isso garante que ela permaneça no lugar, independentemente da consola à qual está ligado.",
    "Is this an officially endorsed service?": "Este é um serviço oficialmente aprovado?",
    "No, this service is simply a creation by a DualShock enthusiast.": "Não, este serviço é apenas uma criação de um entusiasta do DualShock.",
    "Does this website detect if a controller is a clone?": "Este site detecta se um controlador é um clone?",
    "Yes, only DualShock4 at the moment. This happened because I accidentally purchased some clones, spent time identifying the differences and added this functionality to prevent future deception.": "Sim, apenas DualShock4 no momento. Isso aconteceu porque comprei alguns clones por acidente, passei tempo identificando as diferenças e adicionei essa funcionalidade para evitar futuras decepções.",
    "Unfortunately, the clones cannot be calibrated anyway, because they only clone the behavior of a DualShock4 during normal gameplay, not all the undocumented functionalities.": "Infelizmente, os clones não podem ser calibrados de qualquer forma, porque apenas clonam o comportamento do DualShock4 durante o jogo normal, não todas as funcionalidades não documentadas.",
    "If you want to extend this detection functionality to DualSense, please ship me a fake DualSense and you'll see it in few weeks.": "Se você quiser estender esta funcionalidade de detecção ao DualSense, por favor, envie-me um DualSense falso e verá isso em algumas semanas.",
    "What development is in plan?": "Quais são os planos de desenvolvimento?",
    "I maintain two separate to-do lists for this project, although the priority has yet to be established.": "Mantenho duas listas de tarefas separadas para este projeto, embora a prioridade ainda não tenha sido estabelecida.",
    "The first list is about enhancing support for DualShock4 and DualSense controllers:": "A primeira lista é sobre aprimorar o suporte para os controladores DualShock4 e DualSense:",
    "Implement calibration of L2/R2 triggers.": "Implementar a calibração dos gatilhos L2/R2.",
    "Improve detection of clones, particularly beneficial for those seeking to purchase used controllers with assurance of authenticity.": "Melhorar a detecção de clones, especialmente benéfico para aqueles que procuram comprar controladores usados com garantia de autenticidade.",
    "Enhance user interface (e.g. provide additional controller information)": "Melhorar a interface do utilizador (por exemplo, fornecer informações adicionais do controlador)",
    "Add support for recalibrating IMUs.": "Adicionar suporte para recalibrar IMUs.",
    "Additionally, explore the possibility of reviving non-functioning DualShock controllers (further discussion available on Discord for interested parties).": "Adicionalmente, explore a possibilidade de reviver controladores DualShock que não estão funcionando (mais discussão disponível no Discord para partes interessadas).",
    "The second list contains new controllers I aim to support:": "A segunda lista contém novos controladores que pretendo suportar:",
    "DualSense Edge": "DualSense Edge",
    "DualShock 3": "DualShock 3",
    "XBox Controllers": "Controladores Xbox",
    "Each of these tasks presents both immense interest and significant time investment. To provide context, supporting a new controller typically demands 6-12 months of full-time research, alongside a stroke of good fortune.": "Cada uma dessas tarefas apresenta um imenso interesse e um investimento de tempo significativo. Para contextualizar, dar suporte a um novo controlador geralmente exige de 6 a 12 meses de pesquisa a tempo inteiro, além de um golpe de sorte.",
    "I love this service, it helped me! How can I contribute?": "Adorei este serviço, ajudou-me! Como posso contribuir?",
    "I'm glad to hear that you found this helpful! If you're interested in contributing, here are a few ways you can help me:": "Fico feliz por saber que isto foi útil para si! Se estiver interessado em contribuir, estão aqui algumas formas de me ajudar:",
    "Consider making a": "Considere fazer uma ",
    "donation": "doação",
    "to support my late-night caffeine-fueled reverse-engineering efforts.": "para apoiar os meus esforços de engenharia inversa impulsionados pelo meu combustivel de cafeina noturna.",
    "Ship me a controller you would love to add (send me an email for organization).": "Envie-me um controlador que você adoraria adicionar (envie-me um e-mail para organização).",
    "Translate this website in your language": "Traduza este site para o seu idioma",
    ", to help more people like you!": ", para ajudar mais pessoas como você!",
    "This website uses analytics to improve the service.": "Este site utiliza análises para melhorar o serviço.",
    "Board Model": "Modelo da Placa",
    "This feature is experimental.": "Esta funcionalidade é experimental.",
    "Please let me know if the board model of your controller is not detected correctly.": "Por favor, avise-me se o modelo da placa do seu controlador não for detectado corretamente.",
    "Board model detection thanks to": "Detecção do modelo da placa graças a",
    "This DualSense controller has outdated firmware.": "Este controlador DualSense possui um firmware desatualizado.",
    "Please update the firmware and try again.": "Por favor, atualize o firmware e tente novamente.",
    "Joystick Info": "Informações do Joystick",
    "Check circularity": "Verificar circularidade",
    "Can I reset a permanent calibration to previous calibration?": "Posso repor uma calibração permanente para uma calibração anterior?",
    "No.": "Não.",
    "Can you overwrite a permanent calibration?": "É possível substituir uma calibração permanente?",
    "Yes. Simply do another permanent calibration.": "Sim. Basta fazer outra calibração permanente",
    "Does this software resolve stickdrift?": "Esse software resolve o drift do joystick?",
    "Stickdrift is caused by a physical defect; namely dirt, worn potentiometer or in some cases a worn spring.": "O drift nos joysticks é causado por um defeito físico; nomeadamente, sujidades, potenciômetro desgastado ou, em alguns casos, uma mola desgastada.",
    "This software will not fix stick drift on its own if you already experience that. What it will help with, is ensuring the new joystick(s) will function properly after replacing the old one(s) to work well with.": "Este software não resolve o drift por si só, se já tiver com o problema. O que irá ajudar é a garantir que o(s) novo(s) joystick(s) funcione(m) corretamente, após a substituição do(s) antigo(s).",
    "I have noticed some controllers out of the box have worse factory calibration than if I would recalibrate them. Especially true for circularity of SCUF controllers with a unique shell.": "Notei que alguns controladores prontos a usar têm uma calibração de fábrica pior do que se os recalibrasse. Especialmente verdade para a circularidade dos controladores SCUF com um invólucro único.",
    "(Dualsense) Will updating the firmware reset calibration?": "(Dualsense) A atualização do firmware irá repor a calibração?",
    "After range calibration, joysticks always go in corners.": "Após a calibração do alcance, os joysticks vão sempre para os cantos.",
    "This issue happens because you have clicked \"Done\" immediately after starting a range calibration.": "Este problema ocorre porque clicou em \"Concluído\" imediatamente após iniciar uma calibração de alcance.",
    "Please read the instructions.": "Por favor, leia as instruções.",
    "You have to rotate the joysticks before you press \"Done\".": "Tem de rodar os joysticks antes de clicar \"Concluído\"",
    "Make sure to touch the edges of the joystick frame and rotate slowly, preferably in each direction - clockwise and anti-clockwise.": "Certifique-se que toca nas extremidades da estrutura do Joystick e gire lentamente, de prefrerencia em ambas as direções - no sentido dos ponteiros do relógio e no sentido contrário.",
    "Only after you have done that, you click on \"Done\".": "So depois de o fazer, clique em \"Concluído\".",
    "Changes saved successfully": "Alterações salvas com sucesso",
    "Error while saving changes": "Erro ao salvar as alterações.",
    "Save changes permanently": "Salvar alterações permanentemente.",
    "Reboot controller": "Reiniciar controlador",
    "(beta)": "(beta)",
    "<b>Externally</b>: by applying +1.8V directly to the visible test point without opening the controller.": "<b>Externamente</b>: aplicando +1,8 V diretamente ao ponto de teste visível sem abrir o controlador",
    "<b>Internally</b>: by soldering a wire from a +1.8V source to the write-protect TP.": "<b>Internamente</b>: soldadura de um fio de uma fonte de +1,8 V ao TP de proteção contra a escrita.",
    "Battery Barcode": "Código de barras da bateria",
    "Bluetooth Address": "Endereço Bluetooth",
    "Calibration is being stored in the stick modules.": " A calibration esta a ser gravada nos modulos dos joysticks.",
    "Cancel": "Cancelar",
    "Controller Info": "Informação do controlador",
    "Debug Info": "Informação de depuração ",
    "Debug buttons": "Botões de depuração",
    "DualSense Edge Calibration": "Calibração Dualsense Edge",
    "FW Build Date": "Data de compilação do FW",
    "FW Type": "Tipo de FW",
    "FW Update": "Atualização de FW",
    "FW Update Info": "Info da atualização de FW",
    "FW Version": "Versão do FW",
    "Finetune stick calibration": "Ajuste fino da calibração dos joysticks",
    "For more info or help, feel free to reach out on Discord.": "Para mais informações ou ajuda, sinta-se a vontade para me contactar no Discord.",
    "HW Model": "Modelo de HW",
    "Hardware": "Hardware",
    "Left stick": "Joystick esquerdo",
    "MCU Unique ID": "ID Unico da MCU",
    "More details and images": "Mais detalhes e imagens",
    "Please connect a DualShock 4, a DualSense or DualSense Edge controller to your computer and press Connect.": "Ligue um comando DualShock 4, DualSense ou DualSense Edge ao seu computador e prima conectar.",
    "Please note: the stick modules on the DS Edge <b>cannot be calibrated via software alone</b>.": "Nota: os módulos do DS Edge <b>não podem ser calibrados apenas por software</b>.",
    "To store a custom calibration on the stick's internal memory, a <b>hardware modification</b> is required.": "Para armazenar uma calibração personalizada na memória interna do joystick, é necessária uma <b>modificação de hardware</b>.",
    "Right stick": "joystick direito",
    "SBL FW Version": "Versão de FW SBL",
    "Serial Number": "Numero de Série",
    "Show all": "Mostrar tudo",
    "Software": "Software",
    "Spider FW Version": "Versão Spider FW",
    "Support for calibrating DualSense Edge stick modules is now available as an <b>experimental feature</b>.": "O suporte para calibração dos módulos DualSense Edge está agora disponível como <b>recurso experimental</b>.",
    "This involves temporarily disabling write protection by applying <b>+1.8V</b> to a specific test point on each module.": "Isto envolve desativar temporariamente a proteção contra gravação aplicando <b>+1,8 V</b> para um ponto de teste específico em cada módulo",
    "This is only for advanced users. If you're not sure what you're doing, please do not attempt it.": "Isto é apenas para utilizadores avançados. Se não tem a certeza do que está a fazer, por favor, não tente.",
    "Touchpad FW Version": "Versão FW do Touchpad",
    "Touchpad ID": "Touchpad ID",
    "VCM Left Barcode": "Codigo de barras VCM Esquerda",
    "VCM Right Barcode": "Codigo de barras VCM Direita",
    "Venom FW Version": "Versão de FW Venom",
    "We are not responsible for any damage caused by attempting this modification.": "Não nos responsabilizamos por quaisquer dano causado ​​ao tentar usar esta modificação.",
    "You can do this in two ways:": "Pode fazer isto de duas formas",
    "here": "Aqui",
    "Cannot lock": "Não é possível bloquear",
    "Cannot store data into": "Não é possível armazenar dados em",
    "Cannot unlock": "Não é possível desbloquear",
    "Color": "Cor",
    "Color detection thanks to": "Detecção de cor graças a",
    "FW Series": "Série do FW",
    "If the calibration is not stored permanently, please double-check the wirings of the hardware mod.": "Se a calibração não for armazenada permanentemente, verifique novamente os fios soldados na modificação de hardware.",
    "Left Module Barcode": "Código de barras do módulo esquerdo",
    "PCBA ID": "ID do PCBA",
    "Right Module Barcode": "Código de barras do módulo direito",
    "left module": "módulo esquerdo",
    "right module": "módulo direito",
    "10x zoom": "Ampliar 10x",
    "30th Anniversary": "",
    "<strong>Average circularity error:</strong> smaller is not always better! Aim for 7-9 %.": "<strong>Erro médio de circularidade:</strong> menor nem sempre é melhor! Procure entre 7 e 9%.",
    "A reboot is needed to continue using this DualSense Edge. Please disconnect and reconnect your controller.": "É necessário reiniciar o dispositivo para continuar a utilizar o DualSense Edge. Desligue e volte a ligar o controle.",
    "Adaptive Trigger": "Gatilho Adaptável",
    "Adaptive triggers are only supported on DualSense controllers": "Os gatilhos adaptativos são suportados apenas nos controladores DualSense",
    "Add test": "adicionar teste",
    "Astro Bot": "",
    "Be gentle to avoid damage.": "Seja gentil para evitar danos.",
    "Buttons": "Botões",
    "Calibration": "Calibração",
    "Center": "Centro",
    "Center (L1)": "Centro (L1)",
    "Chroma Indigo": "",
    "Chroma Pearl": "",
    "Chroma Teal": "",
    "Circularity": "Circularidade",
    "Circularity (R1)": "Circularidade (R1)",
    "Cobalt Blue": "",
    "Controller does not support adaptive trigger control": "O controlador não suporta o controlo de gatilho adaptável",
    "Cosmic Red": "",
    "Debug": "Depurar",
    "Don't show again": "Don't show again",
    "Fail": "Falha",
    "Failed": "falhou",
    "Failed to connect to device": "Falha ao ligar ao dispositivo",
    "Failed to disable adaptive trigger": "Falha ao desativar o gatilho adaptável",
    "Failed to set speaker tone": "Falha ao definir o tom do altifalante",
    "Failed to set vibration": "Falha ao definir vibração",
    "Feel for vibration in the controller.": "Sinta a vibração no controlador.",
    "Fortnite": "",
    "Galactic Purple": "",
    "God of War Ragnarok": "",
    "Grey Camouflage": "",
    "Haptic Vibration": "Vibração háptica",
    "Headphone Jack": "Entrada dos auscultadores",
    "Increase non-circularity": "Aumentar a não circularidade",
    "Info": "Informação",
    "Instructions": "Instruções",
    "Keep rotating the sticks even if you see no progress!": "Continue a rodar os joysticks mesmo que não veja qualquer progresso!",
    "Learn more...": "Saber mais...",
    "Lights": "Luzes",
    "Listen for a tone from the controller speaker.": "Ouça um tom vindo do altifalante do controlador.",
    "Long-press [circle] to skip ahead.": "Mantenha premido [círculo] para avançar.",
    "Microphone": "microfone",
    "Microphone Level:": "Nivel do microfone",
    "Midnight Black": "",
    "Move the stick to select it for tuning, then without touching the stick use the D-pad buttons to adjust the center point. Flick it and adjust it again if it is off center or flickers.": "Mova o analógico para selecionar a afinação e, sem tocar no analógico, utilize os botões direcionais para ajustar o ponto central. Mova-o e ajuste-o novamente se estiver descentrado ou a piscar.",
    "No controller connected": "Nenhum controlador ligado",
    "No tests completed yet.": "Nenhum teste concluído ainda.",
    "Normal": "Normal",
    "Not tested": "Não testado",
    "Nova Pink": "",
    "Pass": "Passar",
    "Passed": "Passou",
    "Please release the stick to center position before adjusting with D-pad buttons.": "Solte o joystick para a posição central antes de ajustar com os botões D-pad.",
    "Plug in headphones to the 3.5mm jack": "Connecte os auscultadores ao jack de audio de 3,5 mm",
    "Press L2 and R2 triggers to feel the trigger resistance.": "Pressione os gatilhos L2 e R2 para sentir a resistência do gatilho.",
    "Press [circle] to close, or [square] to start over": "Prima [círculo] para fechar ou [quadrado] para recomeçar",
    "Press [square] to Pass, [cross] to Fail, or [circle] to skip.": "Prima [quadrado] para Passar, [cruz] para Reprovar ou [círculo] para Saltar.",
    "Press [square] to begin or [circle] to close": "Prima [quadrado] para começar ou [círculo] para fechar",
    "Press [triangle] to go back.": "Prima [triângulo] para voltar atrás.",
    "Press each button until they turn green.": "Pressione cada botão até que fiquem verdes.",
    "Press the D-pad or face buttons in the direction you want the stick position to move.": "Pressione o D-pad ou os botões frontais na direção em que pretende que a posição do comando se mova.",
    "Progress": "Progresso",
    "Push the stick straight up/down/left/right as far as possible.": "Empurre o joystick para cima/baixo/esquerda/direita o mais possível.",
    "Quick Test": "Teste rápido",
    "Quick calibrate": "Calibração rápida",
    "Range calibration appears to have failed. Please try again and make sure you rotate the sticks.": "A calibração do alcance parece ter falhado. Tente novamente e certifique-se de que roda os joysticks.",
    "Repeat": "Repetir",
    "Restart": "Reiniciar",
    "Rotate the sticks slowly at least 2 times in one direction and 2 times in the other direction to cover the whole range.": "Rode os joysticks lentamente pelo menos 2 vezes numa direção e 2 vezes na outra direção para cobrir todo o alcance.",
    "Run through these tests to verify your controller's functionality.": "Execute estes testes para verificar a funcionalidade do seu controlador.",
    "Show raw numbers": "Mostrar números brutos",
    "Sony controllers come from the factory calibrated to have an average circularity error of nearly 10 %, and this is now what games expect. Too perfect circularity can make movements and aim feel stiff and unresponsive in some games.": "Os comandos da Sony saem de fábrica calibrados para terem um erro médio de circularidade de quase 10%, e é isso que os jogos esperam. Uma circulação demasiado perfeita pode fazer com que os movimentos e a mira pareçam rígidos e sem resposta em alguns jogos.",
    "Speaker": "auscultadores",
    "Spider-Man 2": "",
    "Starlight Blue": "",
    "Step size": "Tamanho do passo",
    "Sterling Silver": "",
    "Test Speaker": "Testar o auscultadores",
    "Test Summary": "Resumo do teste",
    "Test all buttons, or long-press [square] to Pass and [cross] to Fail, or [circle] to skip.": "Teste todos os botões ou mantenha premido [quadrado] para Passar e [cruz] para Reprovar, ou [círculo] para Saltar.",
    "The <b>Done</b> button will unlock after at most 15 seconds. If you press <b>Done</b> without rotating the sticks, the calibration will be incomplete and you will need to repeat it.": "O botão <b>Concluído</b> será desbloqueado após, no máximo, 15 segundos. Se premir <b>Concluído</b> sem rodar os manípulos, a calibração ficará incompleta e será necessário repeti-la.",
    "The Last of Us": "",
    "The device is connected via Bluetooth. Disconnect and reconnect using a USB cable instead.": "O dispositivo está ligado via Bluetooth. Desligue e volte a ligar usando um cabo USB.",
    "This test checks all controller buttons by requiring you to press each button up to three times.": "Este teste verifica todos os botões do comando, exigindo que pressione cada botão até três vezes.",
    "This test checks the headphone jack functionality.": "Este teste verifica a funcionalidade do conector de auscultadores.",
    "This test checks the reliability of the USB port.": "Este teste verifica a fiabilidade da porta USB.",
    "This test will cycle through red, green, and blue colors on the controller lightbar, animate the player indicator lights, and flash the mute button.": "Este teste irá alternar entre as cores vermelha, verde e azul na barra de luzes do comando, animar as luzes indicadoras do jogador e piscar o botão de silenciar.",
    "This test will enable heavy resistance on both L2 and R2 triggers.": "Este teste irá habilitar alta resistência nos gatilhos L2 e R2.",
    "USB Connector": "Conector USB",
    "Volcanic Red": "",
    "Watch the controller lights change colors, the player lights animate, and the mute button flash.": "Observe as luzes do comando a mudar de cor, as luzes do leitor a animarem-se e o botão de silêncio a piscar.",
    "While holding the stick to be adjusted straight up/down/left/right, make adjustments until you see lightblue sectors in all four directions after circling the stick both left and right. Then use the": "Enquanto segura o joystick a ser ajustado para cima/baixo/esquerda/direita, faça ajustes até ver setores azul-claros em todas as quatro direções, depois de rodar o joystick para a esquerda e para a direita. Em seguida, utilize o",
    "White": "",
    "Wiggle the USB cable to see if the controller disconnects.": "Mexa o cabo USB para ver se o comando se desliga.",
    "Your device might not be a genuine Sony controller. If it is not a clone then please report this issue.": "O seu dispositivo pode não ser um comando original da Sony. Se não for um clone, comunique o problema.",
    "failed": "falhou",
    "hide": "ocultar",
    "passed": "passou",
    "skipped": "ignorado",
    "tests completed": "testes concluídos",
    "to increase the non-circularity.": "para aumentar a não circularidade.",
    "": ""
}