{
    ".authorMsg": "- Svensk översättning mha ChatGPT, med vissa modifieringar som syftningsfel, felaktig användning av böjningar osv.",
    "DualShock Calibration GUI": "DualShock kalibreringsgränssnitt",
    "Unsupported browser. Please use a web browser with WebHID support (e.g. Chrome).": "Webbläsaren stöds inte. Vänligen använd en webbläsare med WebHID-stöd (t.ex. Chrome).",
    "Connect a DualShock 4 or a DualSense controller to your computer and press Connect.": "Anslut en DualShock 4 eller en DualSense-kontroller till din dator och tryck på Anslut.",
    "Connect": "Anslut",
    "Connected to:": "Ansluten till:",
    "Disconnect": "Koppla från",
    "Calibrate stick center": "Kalibrera styrspakens mitt",
    "Calibrate stick range": "Kalibrera styrspakens intervall",
    "Sections below are not useful, just some debug infos or manual commands": "Avsnitten nedan är inte användbara, bara lite felsökningsinformation eller manuella kommandon",
    "NVS Status": "NVS Status",
    "Unknown": "Okänd",
    "Debug buttons": "Felsökningsknappar",
    "Query NVS status": "Fråga om NVS-status",
    "NVS unlock": "Lås upp NVS",
    "NVS lock": "Lås NVS",
    "Get BDAddr": "Hämta BDAddr",
    "Fast calibrate stick center (OLD)": "Snabbkalibrera styrspakens mitt (GAMMAL)",
    "Stick center calibration": "Kalibrering av styrspakens mitt",
    "Welcome": "Välkommen",
    "Step 1": "Steg 1",
    "Step 2": "Steg 2",
    "Step 3": "Steg 3",
    "Step 4": "Steg 4",
    "Completed": "Slutfört",
    "Welcome to the stick center-calibration wizard!": "Välkommen till guiden för kalibrering av styrspakens mitt!",
    "This tool will guide you in re-centering the analog sticks of your controller. It consists in four steps: you will be asked to move both sticks in a direction and release them.": "Detta verktyg hjälper dig att justera de analoga styrspakarna på din kontroller. Det består av fyra steg: du kommer att bli ombedd att flytta båda spakarna i en riktning och sedan släppa dem.",
    "Please be aware that, once the calibration is running, it cannot be canceled. Do not close this page or disconnect your controller until is completed.": "Observera att när kalibreringen har startat kan den inte avbrytas. Stäng inte denna sida och koppla inte från din kontroller förrän kalibreringen är klar.",
    "Press Start to begin calibration.": "Tryck på Start för att börja kalibreringen.",
    "Please move both sticks to the top-left corner and release them.": "Flytta båda spakarna till det övre vänstra hörnet och släpp dem.",
    "When the sticks are back in the center, press Continue.": "När spakarna är tillbaka i mitten, tryck på Fortsätt.",
    "Please move both sticks to the top-right corner and release them.": "Flytta båda spakarna till det övre högra hörnet och släpp dem.",
    "Please move both sticks to the bottom-left corner and release them.": "Flytta båda spakarna till det nedre vänstra hörnet och släpp dem.",
    "Please move both sticks to the bottom-right corner and release them.": "Flytta båda spakarna till det nedre högra hörnet och släpp dem.",
    "Calibration completed successfully!": "Kalibreringen slutförd!",
    "Next": "Nästa",
    "Recentering the controller sticks. ": "Centrerar styrspakarna på kontrollern. ",
    "Please do not close this window and do not disconnect your controller. ": "Stäng inte detta fönster och koppla inte från din kontroller. ",
    "Range calibration": "Kalibrering av intervall",
    "The controller is now sampling data!": "Kontrollern samlar nu in data!",
    "Rotate the sticks slowly to cover the whole range. Press \"Done\" when completed.": "Rotera spakarna långsamt för att täcka hela intervallet. Tryck på \"Klar\" när du är färdig.",
    "Done": "Klar",
    "Hi, thank you for using this software.": "Hej, tack för att du använder denna programvara.",
    "If you're finding it helpful and you want to support my efforts, feel free to": "Om du tycker att den är användbar och vill stödja mitt arbete, är du välkommen att",
    "buy me a coffee": "bjuda mig på en kaffe",
    "! :)": "! :)",
    "Do you have any suggestion or issue? Drop me a message via email or discord.": "Har du några förslag eller problem? Skicka ett meddelande via e-post eller Discord.",
    "Cheers!": "Skål!",
    "Support this project": "Stöd detta projekt",
    "unknown": "okänd",
    "original": "original",
    "clone": "klon",
    "locked": "låst",
    "unlocked": "olåst",
    "error": "fel",
    "Build Date": "Tillverkningsdatum",
    "HW Version": "Hårdvaruversion",
    "SW Version": "Mjukvaruversion",
    "Device Type": "Enhetstyp",
    "Range calibration completed": "Intervallskalibrering slutförd",
    "Range calibration failed: ": "Intervallskalibrering misslyckades: ",
    "Cannot unlock NVS": "Kan inte låsa upp NVS",
    "Cannot relock NVS": "Kan inte låsa om NVS",
    "Error 1": "Fel 1",
    "Error 2": "Fel 2",
    "Error 3": "Fel 3",
    "Stick calibration failed: ": "Kalibrering av styrspaken misslyckades: ",
    "Stick calibration completed": "Kalibrering av styrspaken slutförd"
  }  