{
    ".authorMsg": "- Bản dịch tiếng Việt do MeoU cung cấp",
    "DualShock Calibration GUI": "Giao diện Hiệu chỉnh Tay cầm",
    "Connect": "Kết nối",
    "Connected to:": "Đã kết nối với:",
    "Disconnect": "Ngắt kết nối",
    "Calibrate stick center": "Hiệu chỉnh tâm analog",
    "Calibrate stick range": "Hiệu chỉnh phạm vi ngoài analog",
    "Sections below are not useful, just some debug infos or manual commands": "Các phần bên dưới không hữu ích, chỉ là thông tin gỡ lỗi hoặc lệnh thủ công",
    "NVS Status": "Trạng thái NVS",
    "Unknown": "Không rõ",
    "Debug buttons": "Nút Gỡ lỗi",
    "Query NVS status": "Truy vấn trạng thái NVS",
    "NVS unlock": "Mở khóa NVS",
    "NVS lock": "Khóa NVS",
    "Stick center calibration": "Hiệu chỉnh tâm analog",
    "Welcome": "Chào mừng",
    "Step 1": "Bước 1",
    "Step 2": "Bước 2",
    "Step 3": "Bước 3",
    "Step 4": "Bước 4",
    "Completed": "Đã hoàn thành",
    "Welcome to the stick center-calibration wizard!": "Chào mừng đến với trình hướng dẫn hiệu chỉnh tâm analog!",
    "This tool will guide you in re-centering the analog sticks of your controller. It consists of four steps: you will be asked to move both sticks in a direction and release them.": "Công cụ này sẽ hướng dẫn mày cách định vị lại tâm analog. Gồm bốn bước: mày sẽ được yêu cầu di chuyển cả hai cần analog theo một hướng và thả ra.",
    "Please be aware that, <i>once the calibration is running, it cannot be canceled</i>. Do not close this page or disconnect your controller until it is completed.": "Xin lưu ý, <i>một khi quá trình hiệu chỉnh bắt đầu, nó không thể bị hủy</i>. Đừng đóng trang này hoặc ngắt kết nối tay cầm cho đến khi hoàn tất.",
    "Press <b>Start</b> to begin calibration.": "Nhấn <b>Bắt đầu</b> để tiến hành hiệu chỉnh.",
    "Please move both sticks to the <b>top-left corner</b> and release them.": "Vui lòng di chuyển cả hai cần analog đến <b>góc trên bên trái</b> và thả ra.",
    "When the sticks are back in the center, press <b>Continue</b>.": "Khi các cần analog trở về tâm, nhấn <b>Tiếp tục</b>.",
    "Please move both sticks to the <b>top-right corner</b> and release them.": "Vui lòng di chuyển cả hai cần analog đến <b>góc trên bên phải</b> và thả ra.",
    "Please move both sticks to the <b>bottom-left corner</b> and release them.": "Vui lòng di chuyển cả hai cần analog đến <b>góc dưới bên trái</b> và thả ra.",
    "Please move both sticks to the <b>bottom-right corner</b> and release them.": "Vui lòng di chuyển cả hai cần analog đến <b>góc dưới bên phải</b> và thả ra.",
    "Calibration completed successfully!": "Hiệu chỉnh hoàn tất thành công!",
    "Next": "Tiếp theo",
    "Recentering the controller sticks.": "Đang định vị lại tâm analog.",
    "Please do not close this window and do not disconnect your controller. ": "Vui lòng không đóng cửa sổ này và không ngắt kết nối tay cầm.",
    "Range calibration": "Hiệu chỉnh phạm vi ngoài analog",
    "The controller is now sampling data!": "Tay cầm hiện đang lấy mẫu dữ liệu!",
    "Done": "Hoàn thành",
    "Hi, thank you for using this software.": "Chào, cảm ơn mày đã sử dụng phần mềm này.",
    "If you're finding it helpful and you want to support my efforts, feel free to": "Nếu mày thấy nó hữu ích và muốn ủng hộ công sức của tao, hãy ủng hộ nhé!",
    "buy me a coffee": "mời tao một ly cà phê",
    "! :)": "! :)",
    "Do you have any suggestion or issue? Drop me a message via email or discord.": "Mày có đề xuất hay gặp vấn đề gì không? Gửi tin nhắn cho tao qua email hoặc Discord.",
    "Cheers!": "Chúc vui vẻ!",
    "Support this project": "Ủng hộ dự án này",
    "unknown": "Thiết bị không rõ",
    "original": "Hàng chính hãng",
    "clone": "Hàng nhái/Clone",
    "locked": "Đã khóa",
    "unlocked": "Đã mở khóa",
    "error": "Lỗi",
    "Build Date": "Ngày Build",
    "HW Version": "Phiên bản Phần cứng (HW)",
    "SW Version": "Phiên bản Phần mềm (SW)",
    "Device Type": "Loại thiết bị",
    "Range calibration completed": "Hiệu chỉnh phạm vi ngoài analog đã hoàn tất",
    "Range calibration failed": "Hiệu chỉnh phạm vi ngoài analog thất bại",
    "Stick calibration failed": "Hiệu chỉnh analog thất bại",
    "Stick calibration completed": "Hiệu chỉnh analog hoàn tất",
    "NVS Lock failed": "Khóa NVS thất bại",
    "NVS Unlock failed": "Mở khóa NVS thất bại",
    "Please connect only one controller at time.": "Mỗi lần chỉ được kết nối một tay cầm.",
    "Sony DualShock 4 V1": "Tay cầm PS4 V1 (Sony DualShock 4 V1)",
    "Sony DualShock 4 V2": "Tay cầm PS4 V2 (Sony DualShock 4 V2)",
    "Sony DualSense": "Tay cầm PS5 (Sony DualSense)",
    "Sony DualSense Edge": "Tay cầm PS5 Elite/DSE (Sony DualSense Edge)",
    "Connected invalid device": "Đã kết nối thiết bị không hợp lệ",
    "The device appears to be a clone. All calibration functionality is disabled.": "Thiết bị có vẻ là hàng nhái. Tất cả chức năng hiệu chỉnh đều bị vô hiệu hóa.",
    "Error": "Lỗi",
    "Initializing...": "Đang khởi tạo...",
    "Storing calibration...": "Đang lưu hiệu chỉnh...",
    "Sampling...": "Đang lấy mẫu...",
    "Calibration in progress": "Đang tiến hành hiệu chỉnh",
    "Start": "Bắt đầu",
    "Continue": "Tiếp tục",
    "Have a nice day :)": "Chúc mày một ngày tốt lành :)",
    "Welcome to the Calibration GUI": "Chào mừng đến với Giao diện Hiệu chỉnh",
    "Just few things to know before you can start:": "Vài điều cần biết trước khi mày bắt đầu:",
    "This website is not affiliated with Sony, PlayStation &amp; co.": "Trang web này không liên kết với Sony, PlayStation và các công ty liên quan.",
    "This service is provided without warranty. Use at your own risk.": "Dịch vụ này được cung cấp mà không có bảo hành. Mày tự chịu rủi ro khi sử dụng.",
    "Keep the internal battery of the controller connected and ensure it is well charged. If the battery dies during operations, the controller will be damaged and rendered unusable.": "Giữ pin bên trong tay cầm luôn được kết nối và đảm bảo pin đã được sạc đầy. Nếu pin hết trong quá trình thao tác, tay cầm sẽ bị hỏng và không thể sử dụng được.",
    "Before doing the permanent calibration, try the temporary one to ensure that everything is working well.": "Trước khi thực hiện hiệu chỉnh vĩnh viễn, hãy thử hiệu chỉnh tạm thời để đảm bảo mọi thứ hoạt động tốt.",
    "Understood": "Đã hiểu",
    "Version": "Phiên bản",
    "Frequently Asked Questions": "Câu hỏi thường gặp",
    "Close": "Đóng",
    "Welcome to the F.A.Q. section! Below, you'll find answers to some of the most commonly asked questions about this website. If you have any other inquiries or need further assistance, feel free to reach out to me directly. Your feedback and questions are always welcome!": "Chào mừng đến với phần Câu hỏi thường gặp! Dưới đây, mày sẽ tìm thấy câu trả lời cho những câu hỏi phổ biến nhất về trang web này. Nếu mày có bất kỳ thắc mắc nào khác hoặc cần hỗ trợ thêm, hãy liên hệ trực tiếp với tao. Phản hồi và câu hỏi của mày luôn được chào đón!",
    "How does it work?": "Nó hoạt động như thế nào?",
    "Behind the scenes, this website is the culmination of one year of dedicated effort in reverse-engineering DualShock controllers for fun/hobby from a random guy on the internet.": "Đằng sau, trang web này là kết quả của một năm nỗ lực đảo ngược kỹ thuật (reverse-engineering) các tay cầm DualShock vì sở thích của một người bình thường trên mạng.",
    "Through": "Thông qua",
    "this research": "nghiên cứu này",
    ", it was discovered that there exist some undocumented commands on DualShock controllers that can be sent via USB and are used during factory assembly process. If these commands are sent, the controller starts the recalibration of analog sticks.": ", đã phát hiện ra rằng có một số lệnh không được ghi lại trên các tay cầm DualShock có thể gửi qua USB và được sử dụng trong quá trình lắp ráp tại nhà máy. Các lệnh này sẽ khiến tay cầm bắt đầu hiệu chỉnh lại cần analog.",
    "While the primary focus of this research wasn't initially centered on recalibration, it became apparent that a service offering this capability could greatly benefit numerous individuals. And thus, here we are.": "Mặc dù trọng tâm chính của nghiên cứu này ban đầu không phải là hiệu chỉnh lại, nhưng rõ ràng là một dịch vụ cung cấp khả năng này có thể mang lại lợi ích lớn cho nhiều người. Và thế là, nó ra đời.",
    "Does the calibration remain effective during gameplay on PS4/PS5?": "Trong khi chơi game trên PS4/PS5, hiệu chỉnh có còn hiệu quả không?",
    "Yes, if you tick the checkbox \"Write changes permanently in the controller\". In that case, the calibration is flashed directly in the controller firmware. This ensures that it remains in place regardless of the console it's connected to.": "Có, nếu mày chọn ô \"Lưu các thay đổi vĩnh viễn vào tay cầm\". Hiệu chỉnh sẽ được ghi trực tiếp vào firmware của tay cầm. Điều này đảm bảo nó được giữ nguyên bất kể tay cầm được kết nối với console nào.",
    "Is this an officially endorsed service?": "Đây có phải là công cụ được chính thức xác nhận không?",
    "No, this service is simply a creation by a DualShock enthusiast.": "Không, công cụ này chỉ đơn thuần là sản phẩm của một người đam mê DualShock tạo ra.",
    "Does this website detect if a controller is a clone?": "Trang web này có phát hiện được tay cầm là hàng nhái không?",
    "Yes, only DualShock4 at the moment. This happened because I accidentally purchased some clones, spent time identifying the differences and added this functionality to prevent future deception.": "Có, hiện tại chỉ DualShock4. Tao đã vô tình mua phải hàng nhái, dành thời gian xác định sự khác biệt và thêm chức năng này để ngăn chặn lừa đảo trong tương lai. (Người dịch lưu ý: DualSense cũng có thể)",
    "Unfortunately, the clones cannot be calibrated anyway, because they only clone the behavior of a DualShock4 during normal gameplay, not all the undocumented functionalities.": "Thật không may, hàng nhái dù sao cũng không thể hiệu chỉnh được, vì chúng chỉ sao chép hành vi của DualShock4 trong khi chơi game bình thường, chứ không phải tất cả các chức năng không được ghi lại.",
    "If you want to extend this detection functionality to DualSense, please ship me a fake DualSense and you'll see it in few weeks.": "Nếu mày muốn mở rộng chức năng phát hiện này sang DualSense, vui lòng gửi cho tao một tay cầm DualSense giả và mày sẽ thấy nó hoạt động trong vài tuần.",
    "What development is in plan?": "Có kế hoạch phát triển nào không?",
    "I maintain two separate to-do lists for this project, although the priority has yet to be established.": "Tao có hai danh sách việc cần làm riêng biệt cho dự án này, dù chưa biết ưu tiên cái nào.",
    "The first list is about enhancing support for DualShock4 and DualSense controllers:": "Danh sách đầu tiên là về việc tăng cường hỗ trợ cho các tay cầm DualShock4 và DualSense:",
    "Implement calibration of L2/R2 triggers.": "Thực hiện hiệu chỉnh cò (trigger) L2/R2.",
    "Improve detection of clones, particularly beneficial for those seeking to purchase used controllers with assurance of authenticity.": "Cải thiện khả năng phát hiện hàng nhái, đặc biệt có lợi cho những người muốn mua tay cầm đã qua sử dụng với sự đảm bảo về tính xác thực.",
    "Enhance user interface (e.g. provide additional controller information)": "Cải thiện giao diện người dùng (ví dụ: cung cấp thêm thông tin về tay cầm)",
    "Add support for recalibrating IMUs.": "Thêm hỗ trợ hiệu chỉnh lại IMU (con quay hồi chuyển).",
    "Additionally, explore the possibility of reviving non-functioning DualShock controllers (further discussion available on Discord for interested parties).": "Ngoài ra, khám phá khả năng cứu chữa các tay cầm DualShock bị hỏng (thảo luận thêm có sẵn trên Discord cho những người quan tâm).",
    "The second list contains new controllers I aim to support:": "Danh sách thứ hai bao gồm các tay cầm mới mà tao dự định hỗ trợ:",
    "DualSense Edge": "DualSense Edge",
    "DualShock 3": "DualShock 3",
    "XBox Controllers": "Tay cầm Xbox",
    "Each of these tasks presents both immense interest and significant time investment. To provide context, supporting a new controller typically demands 6-12 months of full-time research, alongside a stroke of good fortune.": "Mỗi nhiệm vụ này đều có sự quan tâm lớn và đòi hỏi đầu tư thời gian đáng kể. Để mày dễ hình dung, việc hỗ trợ một tay cầm mới thường mất 6-12 tháng nghiên cứu toàn thời gian, cùng với một chút may mắn.",
    "I love this service, it helped me! How can I contribute?": "Web hiệu chỉnh này đỉnh quá! Tao muốn ủng hộ nhà phát triển!",
    "I'm glad to hear that you found this helpful! If you're interested in contributing, here are a few ways you can help me:": "Rất vui vì công cụ này giúp ích được cho mày! Nếu mày muốn đóng góp, đây là một vài cách mày có thể giúp tao:",
    "Consider making a": "Hãy cân nhắc ",
    "donation": "quyên góp",
    "to support my late-night caffeine-fueled reverse-engineering efforts.": "để ủng hộ những nỗ lực đảo ngược kỹ thuật thâu đêm với cà phê của tao.",
    "Ship me a controller you would love to add (send me an email for organization).": "Gửi cho tao một tay cầm mà mày muốn tao thêm vào (liên hệ qua email).",
    "Translate this website in your language": "Dịch trang web này sang ngôn ngữ của mày",
    ", to help more people like you!": "để giúp đỡ nhiều người hơn như mày!",
    "This website uses analytics to improve the service.": "Trang web này sử dụng công cụ phân tích để cải thiện chất lượng dịch vụ.",
    "Board Model": "Mẫu bo mạch",
    "This DualSense controller has outdated firmware.": "Tay cầm DualSense này có firmware đã lỗi thời.",
    "Please update the firmware and try again.": "Vui lòng cập nhật firmware và thử lại.",
    "Joystick Info": "Thông tin Joystick",
    "Check circularity": "Kiểm tra độ tròn analog",
    "Can I reset a permanent calibration to previous calibration?": "Tao có thể quay lại hiệu chỉnh trước đó không?",
    "No.": "Không.",
    "Can you overwrite a permanent calibration?": "Có thể ghi đè lên hiệu chỉnh vĩnh viễn không?",
    "Yes. Simply do another permanent calibration.": "Có, chỉ cần thực hiện một hiệu chỉnh vĩnh viễn khác.",
    "Does this software resolve stickdrift?": "Phần mềm này có giải quyết được lỗi stick drift (trôi analog) không?",
    "Stickdrift is caused by a physical defect; namely dirt, worn potentiometer or in some cases a worn spring.": "Stick drift là do lỗi vật lý, thường là bụi bẩn, chiết áp bị mòn, hoặc đôi khi là lò xo bị mòn.",
    "This software will not fix stick drift on its own if you already experience that. What it will help with, is ensuring the new joystick(s) will function properly after replacing the old one(s) to work well with.": "Nếu mày đang gặp phải stick drift, phần mềm này sẽ không tự động sửa lỗi. Nhưng nó giúp đảm bảo (các) joystick mới sẽ hoạt động chính xác sau khi thay thế (các) cái cũ. (Người dịch lưu ý: Hiệu chỉnh có thể giảm thiểu hiện tượng trôi, nhưng không thể loại bỏ hoàn toàn nếu cần analog quá tệ).",
    "I have noticed some controllers out of the box have worse factory calibration than if I would recalibrate them. Especially true for circularity of SCUF controllers with a unique shell.": "Tao nhận thấy một số tay cầm mới mua có hiệu chỉnh tại nhà máy kém hơn so với việc tao hiệu chỉnh lại. Đặc biệt rõ rệt đối với độ tròn của tay cầm SCUF với vỏ độc đáo.",
    "(Dualsense) Will updating the firmware reset calibration?": "(Dualsense) Việc cập nhật firmware có đặt lại hiệu chỉnh không?",
    "After range calibration, joysticks always go in corners.": "Sau khi hiệu chỉnh phạm vi, analog bị trôi vào góc.",
    "This issue happens because you have clicked \"Done\" immediately after starting a range calibration.": "Vấn đề này xảy ra vì mày đã nhấp \"Hoàn thành\" ngay sau khi bắt đầu hiệu chỉnh phạm vi.",
    "Please read the instructions.": "Vui lòng đọc hướng dẫn.",
    "You have to rotate the joysticks before you press \"Done\".": "Mày phải xoay analog trước khi nhấn \"Hoàn thành\".",
    "Make sure to touch the edges of the joystick frame and rotate slowly, preferably in each direction - clockwise and anti-clockwise.": "Đảm bảo analog chạm vào viền khung và xoay chậm, tốt nhất là theo cả hai hướng - kim đồng hồ và ngược kim đồng hồ.",
    "Only after you have done that, you click on \"Done\".": "Chỉ sau khi mày làm xong, hãy nhấp vào \"Hoàn thành\".",
    "Changes saved successfully": "Thay đổi đã được lưu thành công.",
    "Error while saving changes": "Lỗi khi lưu thay đổi:",
    "Save changes permanently": "Lưu các thay đổi vĩnh viễn",
    "Reboot controller": "Khởi động lại tay cầm",
    "Controller Info": "Thông tin Tay cầm",
    "Debug Info": "Thông tin Gỡ lỗi",
    "Software": "Phần mềm",
    "Hardware": "Phần cứng",
    "FW Build Date": "Ngày Build FW",
    "FW Type": "Loại FW",
    "FW Series": "Series FW",
    "FW Version": "Phiên bản FW",
    "FW Update": "Cập nhật FW",
    "FW Update Info": "Thông tin Nâng cấp FW",
    "SBL FW Version": "Phiên bản FW SBL",
    "Venom FW Version": "Phiên bản FW Venom",
    "Spider FW Version": "Phiên bản FW Spider",
    "Touchpad FW Version": "Phiên bản FW Touchpad",
    "Serial Number": "Số seri",
    "MCU Unique ID": "ID duy nhất MCU",
    "PCBA ID": "ID PCBA",
    "Battery Barcode": "Mã vạch Pin",
    "VCM Left Barcode": "Mã vạch VCM Trái",
    "VCM Right Barcode": "Mã vạch VCM Phải",
    "HW Model": "Mẫu HW",
    "Touchpad ID": "ID Touchpad",
    "Bluetooth Address": "Địa chỉ Bluetooth",
    "Show all": "Hiển thị tất cả thông tin",
    "Finetune stick calibration": "Hiệu chỉnh analog tinh chỉnh",
    "(beta)": "(bản thử nghiệm)",
    "Left stick": "Analog trái (mV)",
    "Right stick": "Analog phải (mV)",
    "Cancel": "Hủy",
    "<b>Externally</b>: by applying +1.8V directly to the visible test point without opening the controller.": "<b>Bên ngoài</b>: Không cần mở tay cầm, cấp +1.8V trực tiếp vào điểm thử nghiệm (test point) có thể nhìn thấy.",
    "<b>Internally</b>: by soldering a wire from a +1.8V source to the write-protect TP.": "<b>Bên trong</b>: Hàn dây từ nguồn +1.8V đến TP bảo vệ ghi (write-protect TP).",
    "Calibration is being stored in the stick modules.": "Dữ liệu hiệu chỉnh đang được lưu vào các mô-đun analog.",
    "DualSense Edge Calibration": "Hiệu chỉnh DualSense Edge",
    "For more info or help, feel free to reach out on Discord.": "Cần thêm thông tin hoặc trợ giúp, hãy liên hệ trên Discord.",
    "More details and images": "Thêm chi tiết và hình ảnh",
    "Please note: the stick modules on the DS Edge <b>cannot be calibrated via software alone</b>.": "Xin lưu ý: các mô-đun analog trên DS Edge <b>không thể được hiệu chỉnh chỉ bằng phần mềm</b>.",
    "To store a custom calibration on the stick's internal memory, a <b>hardware modification</b> is required.": "Để lưu hiệu chỉnh tùy chỉnh vào bộ nhớ trong của analog, cần phải có một <b>thao tác phần cứng</b>.",
    "Support for calibrating DualSense Edge stick modules is now available as an <b>experimental feature</b>.": "Hỗ trợ hiệu chỉnh các mô-đun analog của DualSense Edge hiện đã có sẵn dưới dạng <b>tính năng thử nghiệm</b>.",
    "This involves temporarily disabling write protection by applying <b>+1.8V</b> to a specific test point on each module.": "Điều này liên quan đến việc tạm thời vô hiệu hóa bảo vệ ghi bằng cách cấp <b>+1.8V</b> vào một điểm thử nghiệm cụ thể trên mỗi mô-đun.",
    "This is only for advanced users. If you're not sure what you're doing, please do not attempt it.": "Điều này chỉ dành cho người dùng nâng cao. Nếu mày không chắc chắn mình đang làm gì, vui lòng không thử.",
    "We are not responsible for any damage caused by attempting this modification.": "Tao không chịu trách nhiệm cho bất kỳ thiệt hại nào do việc cố gắng thực hiện thao tác này.",
    "You can do this in two ways:": "Mày có thể làm điều này bằng hai cách:",
    "here": "tại đây",
    "If the calibration is not stored permanently, please double-check the wirings of the hardware mod.": "Nếu hiệu chỉnh không được lưu vĩnh viễn, vui lòng kiểm tra lại dây nối của mod phần cứng.",
    "Cannot lock": "Không thể khóa",
    "Cannot store data into": "Không thể lưu dữ liệu vào",
    "Cannot unlock": "Không thể mở khóa",
    "Color": "Màu sắc",
    "Left Module Barcode": "Mã vạch Mô-đun Trái",
    "Right Module Barcode": "Mã vạch Mô-đun Phải",
    "left module": "mô-đun trái",
    "right module": "mô-đun phải",
    "30th Anniversary": "Phiên bản Kỷ niệm 30 năm",
    "Astro Bot": "Astro Bot",
    "Cobalt Blue": "Xanh Cobalt",
    "Cosmic Red": "Đỏ Vũ trụ",
    "Galactic Purple": "Tím Thiên hà",
    "God of War Ragnarok": "God of War Ragnarok",
    "Grey Camouflage": "Rằn ri Xám",
    "Midnight Black": "Đen Huyền bí",
    "Nova Pink": "Hồng Nova",
    "Starlight Blue": "Xanh Ánh sao",
    "Sterling Silver": "Bạc Sterling",
    "Volcanic Red": "Đỏ Núi lửa",
    "White": "Trắng",
    "Chroma Indigo": "Chroma Indigo",
    "Chroma Pearl": "Chroma Pearl",
    "Chroma Teal": "Chroma Teal",
    "Fortnite": "Fortnite",
    "Spider-Man 2": "Spider-Man 2",
    "The Last of Us": "The Last of Us",
    "10x zoom": "Test tốc độ 10x",
    "Calibration": "Hiệu chỉnh",
    "Debug": "Gỡ lỗi",
    "Info": "Thông tin",
    "Normal": "Bình thường",
    "<strong>Average circularity error:</strong> smaller is not always better! Aim for 7-9 %.": "<strong>Lỗi độ tròn trung bình của analog</strong>: Bình thường nên dưới 9%.",
    "A reboot is needed to continue using this DualSense Edge. Please disconnect and reconnect your controller.": "Cần khởi động lại để tiếp tục sử dụng DualSense Edge này. Vui lòng ngắt kết nối và kết nối lại tay cầm.",
    "Adaptive Trigger": "Cò (Trigger) thích ứng",
    "Adaptive triggers are only supported on DualSense controllers": "Cò thích ứng chỉ được hỗ trợ trên tay cầm PS5",
    "Add test": "Thực hiện kiểm tra",
    "Be gentle to avoid damage.": "Thao tác nhẹ nhàng để tránh hư hỏng",
    "Buttons": "Nút bấm",
    "Center": "Tâm",
    "Center (L1)": "Tâm (L1)",
    "Circularity": "Độ tròn",
    "Circularity (R1)": "Độ tròn (R1)",
    "Controller does not support adaptive trigger control": "Tay cầm không hỗ trợ điều khiển cò thích ứng",
    "Don't show again": "Không hiển thị lại",
    "Fail": "Thất bại",
    "Failed": "Đã thất bại",
    "Failed to connect to device": "Không thể kết nối với thiết bị",
    "Failed to disable adaptive trigger": "Không thể tắt cò thích ứng",
    "Failed to set speaker tone": "Không thể đặt âm lượng loa",
    "Failed to set vibration": "Không thể đặt độ rung",
    "Feel for vibration in the controller.": "Cảm nhận độ rung của tay cầm",
    "Haptic Vibration": "Rung phản hồi",
    "Headphone Jack": "Jack tai nghe",
    "Increase non-circularity": "Tăng độ không tròn",
    "Instructions": "Hướng dẫn",
    "Keep rotating the sticks even if you see no progress!": "Tiếp tục xoay analog cho đến khi thanh tiến trình đầy",
    "Learn more...": "Tìm hiểu thêm...",
    "Lights": "Đèn",
    "Listen for a tone from the controller speaker.": "Lắng nghe âm báo từ loa tay cầm",
    "Long-press [circle] to skip ahead.": "Nhấn giữ [circle] để bỏ qua.",
    "Microphone": "Micrô",
    "Microphone Level:": "Mức Micrô",
    "Move the stick to select it for tuning, then without touching the stick use the D-pad buttons to adjust the center point. Flick it and adjust it again if it is off center or flickers.": "Di chuyển analog để chọn vị trí muốn điều chỉnh, sau đó sử dụng các nút D-pad để điều chỉnh điểm trung tâm (không cần chạm vào analog). Nếu tâm bị lệch, hãy gẩy nhẹ analog và điều chỉnh lại.",
    "No controller connected": "Chưa kết nối tay cầm nào",
    "No tests completed yet.": "Chưa hoàn thành bài kiểm tra nào",
    "Not tested": "Chưa kiểm tra",
    "Pass": "Đạt",
    "Passed": "Đã đạt",
    "Please release the stick to center position before adjusting with D-pad buttons.": "Vui lòng đảm bảo analog ở vị trí chính giữa trước khi điều chỉnh bằng các nút D-pad.",
    "Plug in headphones to the 3.5mm jack": "Cắm tai nghe vào cổng 3.5mm",
    "Press L2 and R2 triggers to feel the trigger resistance.": "Nhấn cò L2 và R2 để cảm nhận lực cản của cò",
    "Press [circle] to close, or [square] to start over": "Nhấn [circle] để đóng, hoặc [square] để bắt đầu lại",
    "Press [square] to Pass, [cross] to Fail, or [circle] to skip.": "Nhấn [square] để Đạt, [cross] để Lỗi, hoặc [circle] để bỏ qua.",
    "Press [square] to begin or [circle] to close": "Nhấn [square] để bắt đầu hoặc [circle] để đóng",
    "Press [triangle] to go back.": "Nhấn [triangle] để quay lại.",
    "Press each button until they turn green.": "Nhấn từng nút cho đến khi chúng chuyển sang màu xanh lá cây",
    "Press the D-pad or face buttons in the direction you want the stick position to move.": "Nhấn D-pad hoặc các nút mặt theo hướng mày muốn vị trí analog di chuyển.",
    "Progress": "Tiến trình",
    "Push the stick straight up/down/left/right as far as possible.": "Đẩy analog thẳng lên/xuống/trái/phải hết mức có thể.",
    "Quick Test": "Kiểm tra nhanh",
    "Quick calibrate": "Hiệu chỉnh nhanh",
    "Range calibration appears to have failed. Please try again and make sure you rotate the sticks.": "Hiệu chỉnh phạm vi thất bại. Vui lòng thử lại và đảm bảo đã xoay analog.",
    "Repeat": "Lặp lại",
    "Restart": "Khởi động lại",
    "Rotate the sticks slowly at least 2 times in one direction and 2 times in the other direction to cover the whole range.": "Xoay analog chậm rãi ít nhất 2 lần theo một hướng và 2 lần theo hướng ngược lại để bao phủ toàn bộ phạm vi.",
    "Run through these tests to verify your controller's functionality.": "Thực hiện các bài kiểm tra này để kiểm tra chức năng của tay cầm.",
    "Show raw numbers": "Hiển thị dữ liệu thô",
    "Sony controllers come from the factory calibrated to have an average circularity error of nearly 10 %, and this is now what games expect. Too perfect circularity can make movements and aim feel stiff and unresponsive in some games.": "Các tay cầm Sony xuất xưởng được hiệu chỉnh với lỗi độ tròn trung bình gần 10%, và đây là điều mà các trò chơi mong đợi. Độ tròn quá hoàn hảo có thể khiến chuyển động và ngắm bắn cảm thấy cứng và kém phản hồi trong một số trò chơi.",
    "Speaker": "Loa",
    "Step size": "Kích thước bước",
    "Test Speaker": "Kiểm tra Loa",
    "Test Summary": "Tóm tắt Kiểm tra",
    "Test all buttons, or long-press [square] to Pass and [cross] to Fail, or [circle] to skip.": "Kiểm tra tất cả các nút, hoặc nhấn giữ [square] để Đạt, [cross] để Lỗi, hoặc [circle] để bỏ qua.",
    "The <b>Done</b> button will unlock after at most 15 seconds. If you press <b>Done</b> without rotating the sticks, the calibration will be incomplete and you will need to repeat it.": "Nút <b>Hoàn thành</b> sẽ mở khóa sau tối đa 15 giây. Nếu mày nhấn <b>Hoàn thành</b> mà không xoay analog, hiệu chỉnh sẽ không hoàn tất và mày cần phải lặp lại.",
    "The device is connected via Bluetooth. Disconnect and reconnect using a USB cable instead.": "Tay cầm đang được kết nối bằng Bluetooth. Vui lòng ngắt kết nối và kết nối lại bằng cáp USB.",
    "This test checks all controller buttons by requiring you to press each button up to three times.": "Bài kiểm tra này kiểm tra tất cả các nút bấm của tay cầm bằng cách yêu cầu mày nhấn mỗi nút tối đa ba lần.",
    "This test checks the headphone jack functionality.": "Bài kiểm tra này kiểm tra chức năng của jack tai nghe.",
    "This test checks the reliability of the USB port.": "Bài kiểm tra này kiểm tra cổng USB có hoạt động bình thường không.",
    "This test will cycle through red, green, and blue colors on the controller lightbar, animate the player indicator lights, and flash the mute button.": "Bài kiểm tra này sẽ chuyển đổi qua các màu đỏ, xanh lá, và xanh dương trên thanh đèn của tay cầm, tạo hiệu ứng đèn báo người chơi, và làm nút tắt tiếng nhấp nháy.",
    "This test will enable heavy resistance on both L2 and R2 triggers.": "Bài kiểm tra này sẽ kích hoạt lực cản nặng trên cả cò L2 và R2.",
    "USB Connector": "Cổng kết nối USB",
    "Watch the controller lights change colors, the player lights animate, and the mute button flash.": "Quan sát đèn tay cầm đổi màu, đèn báo người chơi chuyển động, và nút tắt tiếng có nhấp nháy không.",
    "While holding the stick to be adjusted straight up/down/left/right, make adjustments until you see lightblue sectors in all four directions after circling the stick both left and right. Then use the": "Trong khi giữ analog cần điều chỉnh thẳng lên/xuống/trái/phải, thực hiện điều chỉnh cho đến khi mày thấy các khu vực màu xanh nhạt ở cả bốn hướng sau khi xoay tròn analog sang cả trái và phải. Sau đó dùng",
    "Wiggle the USB cable to see if the controller disconnects.": "Lắc nhẹ cáp USB để kiểm tra tay cầm có bị ngắt kết nối không.",
    "Your device might not be a genuine Sony controller. If it is not a clone then please report this issue.": "Tay cầm này có thể không phải là tay cầm Sony chính hãng.",
    "failed": "thất bại",
    "hide": "ẩn",
    "passed": "đã đạt",
    "skipped": "đã bỏ qua",
    "tests completed": "bài kiểm tra đã hoàn thành",
    "to increase the non-circularity.": "để tăng độ không tròn.",
    "After they have been replaced, this utility can be used to calibrate the controller to work with the new joysticks.": "",
    "Aim for a circularity error of around 7-9 % for the best playing experience.": "",
    "Battery level is low. Tests may fail due to the controller being in power saving mode.": "",
    "Calibrating without replacing the joysticks may help temporarily, but it may also make the problem worse, with no way to undo it.": "",
    "Calibration History": "",
    "Cannot copy text to the clipboard:": "",
    "Cannot read module barcodes": "",
    "Clear All": "",
    "Current": "",
    "Delete": "",
    "Delete all calibration history for this controller? This cannot be undone.": "",
    "Delete this calibration entry?": "",
    "Drift is caused by mechanical parts in the joystick being worn out, and they need to be replaced to fix the drift.": "",
    "Firefox is supported with the WebHID extension installed.": "",
    "It appears the latest joystick calibration has not been saved.": "",
    "Last connected": "",
    "No saved calibrations found.": "",
    "Please connect a DualShock 4, a DualSense, DualSense Edge or VR2 controller to your computer and press Connect.": "",
    "Please use a web browser with WebHID support (e.g. Google Chrome or Microsoft Edge) on a PC or Mac.": "",
    "Restore": "",
    "Restore calibration": "",
    "The calibration was restored successfully! Remember to save the changes in order not to loose them when the controller is rebooted.": "",
    "The item has been copied to the clipboard.": "",
    "This controller has unsaved changes that will be lost when the controller is rebooted.": "",
    "This utility cannot fix stick drift.": "",
    "Unsupported browser.": "",
    "Use expert mode": "",
    "Use four-step calibration": "",
    "Use normal mode": "",
    "Use quick calibration": "",
    "Using this utility on a phone or tablet is not supported.": "",
    "Values": "",
    "You should save your changes, or reboot the controller to revert back to the previous state.": "",
    "serial number": "",
    "": ""
}